{
  "scraped_data": [
    {
      "lead_id": "ACoAAAcEQVMB5S6hBVJ9tO5WPsyYK2Ut_DwVt4I",
      "name": "Pratik Kundu",
      "title": "Project Manager\nProject Manager",
      "location": "Mumbai, Maharashtra, India",
      "profile_url": "https://www.linkedin.com/in/ACoAAAcEQVMB5S6hBVJ9tO5WPsyYK2Ut_DwVt4I",
      "bio": "Manager, Engagement Delivery at Salesforce | Ex-Deloitte\nIT professional with over 10+ years experience in IT Consulting focusing primarily on Salesforce ecosystem as the Solution architect. \nExpertise on-time delivery involved in planning, architect & design followed by implementation of Salesforce SDLC.\nPossesses rich experience on Salesforce Education Cloud, service cloud, sales cloud & Digital experience.\nLed many successful RFPs and aided in estimation, planning, and Staffing.\n\nInitially worked as a Siebel EAI and EIM developer and then transitioned to Salesforce as a developer & now as a Tech lead.\nThese varied experiences have helped in developing a blend of strong stakeholder (client/internal) facing and analytical/problem-solving skills. Being a quick learner along with the ability to absorb and adapt quickly has paid rich dividends so far.\n\nAspire to consistently harness the ever-growing spectrum of the Salesforce.com ecosystem to help businesses effectively strategize and accelerate their overall growth and operational efficiencies, and in the process benefit the end Customers and users in a significant way.\n…see more",
      "skills": [
        "Siebel\nSiebel",
        "Unix Shell Scripting\nUnix Shell Scripting"
      ],
      "experience": "Project Manager\nProject Manager\nSalesforce · Full-time\nSalesforce · Full-time\nAug 2022 - Present · 3 yrs 2 mos\nAug 2022 to Present · 3 yrs 2 mos\nIndia\nIndia",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAABConZABvXkvJ4rJsxQKOyAQKi7VHy1CWNQ",
      "name": "Palani Chinnasamy",
      "title": "Salesforce Senior Consultant\nSalesforce Senior Consultant",
      "location": "Bengaluru, Karnataka, India",
      "profile_url": "https://www.linkedin.com/in/ACoAABConZABvXkvJ4rJsxQKOyAQKi7VHy1CWNQ",
      "bio": "Salesforce Senior Consultant @Deloitte | 12x Salesforce Certified Application Architect | Lightning Expert | Agentforce Specialist\nExperience Summary:\n11 + years of experience in Salesforce Platform development.\nEnthusiastic to work and learn new technologies. Good team player with good communication and problem-solving skills and to promote quality in the team environment.\n\nSummary:\n● Extensive experience in Salesforce development, configuration, and implementation\n● Extensive experience in configuration, customization including creating custom objects, workflow rules, process builder, flows, approval process, email templates, lightning app builder\n● Extensive experience in creating apex classes, Apex triggers, Visualforce pages, lightning aura components, and lightning web component (LWC)\n● Experience in using VS Code & Intellij IDE to develop, enhance, test, and deploy applications on the force.com platform.\n● Extensive domain knowledge on field service management application\n● Experience in using Data loader for data import and export\n● Extensive experience in integrating Salesforce with other applications\n● Experience in tracking, managing, troubleshoot and resolve problems, technical issues, and configuration needs of Salesforce users\n● Performed bulk data migration from one Org to another using Talend Open Studio, Data loader\n● Experience in Salesforce migration from classic to lightning experience.\n…see more",
      "skills": [
        "Technical Lead\nTechnical Lead",
        "LWC\nLWC"
      ],
      "experience": "Salesforce Senior Consultant\nSalesforce Senior Consultant\nDeloitte · Full-time\nDeloitte · Full-time\nMar 2022 - Present · 3 yrs 7 mos\nMar 2022 to Present · 3 yrs 7 mos\nBengaluru, Karnataka, India\nBengaluru, Karnataka, India\nSalesforce Lightning, Salesforce Sales Cloud and +7 skills",
      "company_name": "Deloitte · Full-time",
      "company_page_url": "https://www.linkedin.com/company/1038/"
    },
    {
      "lead_id": "ACoAACdtWZYBl_QF_JZD413pbhei-vp7ZnnfoS0",
      "name": "Neeraj Dwivedi ☁️",
      "title": "Associate Consultant\nAssociate Consultant",
      "location": "Noida, Uttar Pradesh, India",
      "profile_url": "https://www.linkedin.com/in/ACoAACdtWZYBl_QF_JZD413pbhei-vp7ZnnfoS0",
      "bio": "Salesforce Consultant | Ex-Accenture | Ex-TCS | 4x Salesforce Certified | 12x Superbadge | Apex | Asynchronous Apex | LWC | Omnistudio | API Integrations | Lightning Flows\nI possess a strong understanding of the Salesforce platform and its various modules. Throughout my journey in Salesforce, I have honed my skills in customizing, configuring, and implementing solutions using Apex, Visualforce, and Lightning components. I have played a major role in developing and maintaining Salesforce applications, seamlessly integrating third-party tools to enhance functionality.\nI have experience gathering requirements and translating them into actionable solutions. I am well-versed in unit testing and continuous integration practices, emphasizing the importance of reliable and scalable code.\n\nI am dedicated to driving business growth and efficiency through my expertise in Salesforce development and implementation. My passion for this field motivates me to deliver exceptional results and exceed expectations.\n…see more",
      "skills": [
        "Salesforce Flows\nSalesforce Flows",
        "Experience Cloud\nExperience Cloud"
      ],
      "experience": "Associate Consultant\nAssociate Consultant\nInfosys Public Services · Full-time\nInfosys Public Services · Full-time\nDec 2024 - Present · 10 mos\nDec 2024 to Present · 10 mos\nNoida, Uttar Pradesh, India · Hybrid\nNoida, Uttar Pradesh, India · Hybrid\n helped me get this job\nLinkedIn helped me get this job\nSalesforce.com Development, Salesforce Flows and +5 skills",
      "company_name": "Infosys Public Services · Full-time",
      "company_page_url": "https://www.linkedin.com/company/2447954/"
    },
    {
      "lead_id": "ACoAAA-ycu4BeCoktunp-MSzlnbjt3lo_DPd77E",
      "name": "Ryan Dishman",
      "title": "Salesforce\nSalesforce",
      "location": "San Diego, California, United States",
      "profile_url": "https://www.linkedin.com/in/ACoAAA-ycu4BeCoktunp-MSzlnbjt3lo_DPd77E",
      "bio": "Sr. Manager, Information Security at Salesforce | LCDR USNR\nAs a cloud security professional I help organizations with regulatory compliance, framework adoption and resilience against emerging threats. My foundation is shaped by over a decade of military service and a M.S. in Cyber Systems and Operations.\n\nMy focus areas include AI security, governance, architecture, information risk management, identity and access management, privacy, encryption, and incident management—including triage and post-event communication. I've worked with a wide range of frameworks and standards, including FedRAMP Mod/High, DoD IL 2/4/5, CJIS, CMMC, CIS, NIST 800-53, NIST 800-171, IRS 1075, PCI-DSS, HITRUST, SOC 1/2/3, ISO 27000/31000, and the Authority to Operate (ATO) process.\n…see more",
      "skills": [
        "Malware\nMalware",
        "Web Application Security\nWeb Application Security"
      ],
      "experience": "Salesforce\nSalesforce\nFull-time · 1 yr 7 mos\nFull-time · 1 yr 7 mos\nSenior Manager, Security and Compliance\nSenior Manager, Security and Compliance\nAug 2024 - Present · 1 yr 2 mos\nAug 2024 to Present · 1 yr 2 mos\n▫ Leads security and compliance discussions with federal, state, and local customers\n\n▫ Evaluates product security and performs gap analyses to proactively address compliance and regulatory challenges\n\n▫ Provides customers with insights on vulnerabilities, incidents, and emerging threats\n\n▫ Oversees the completion and quality review of security documentation to support sales cycles and customer trust\n\n▫ Coordinates customer audits and leads contract and agreement reviews to maintain compliance with security standards\nSlack Customer Success Manager (HoH Skillbridge Fellow)\nSlack Customer Success Manager (HoH Skillbridge Fellow)\nMar 2024 - Aug 2024 · 6 mos\nMar 2024 to Aug 2024 · 6 mos",
      "company_name": "Full-time · 1 yr 7 mos",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAACPgvWoBgqEuv3IwEmCp0TMuRvbPK-_CKEk",
      "name": "Santhosh Rebello",
      "title": "University Program Manager - India, Salesforce \nUniversity Program Manager - India, Salesforce",
      "location": "Karnataka, India",
      "profile_url": "https://www.linkedin.com/in/ACoAACPgvWoBgqEuv3IwEmCp0TMuRvbPK-_CKEk",
      "bio": "Global Workforce Development & University Program Manager-India, Salesforce, Bangalore | Researcher in AI, ML & DL & NLP | International Relations | Industry Collaborations | Author | Educator\nWorking as Global Workforce Development and University Program Manager for India, at Salesforce from January 2022, promoting skill based training program at the Universities, Engineering and Technological campuses in India. \n\nWorked as the Professor of AI, ML & DL & Head at IT, St Aloysius Deemed to be University, Mangalore; He carries the teaching and mentoring experience in multidisciplinary such as IT and Business having the Masters in Computer Science, Philosophy, Business Management etc with focussed Research on Software Reliability.\n\nHe worked as Project Lead of the RISHII - Resources for Internationalization of Higher Education Institutions in India of ERASMUS+ from the European Union from Jan 2018 to December 2021\n\nWorked towards Industry -Academia Collaboration and successfully collaborated with many IT / ITE Companies as a SPOC, Advisor and Coordinator for the Professional Program Design, Curriculum Design and Development\n\nServed as the Coordinator of the Bioinformatics Facility (BIF) which is a part of BTIS Network, initiative from Dept of Biotechnology, Ministry of Science and Technology, Govt of India\n\nWorked as Executive Member of the Core committee pf Karnataka Post Graduate Private College’s Association, Bangalore (with B Schools & IT Schools), which engages with UGC, AICTE, Govt of Karnataka for the Educational Leadership\n\nPassionate Mentor and Certified Entrepreneurship Educator and International Jury for startup ventures by NEN/ Wadhwani Foundation Global for 4 years\n\nWorked as President of Institute Innovation Council (IIC) of St Aloysius College (Autonomous), Mangalore; an initiative from Ministry of Skill Development and AICTE\n\nServed as the Coordinator of the Indira Gandhi National Open University from Jan 2021 to December 2021 , served as the Asst Coordinator of IGNOU from Jan 2005 to December 2020\n\nAuthored Two Books, “Fundamental Simulation Methodologies Dwelling in Neural Networks-Algorithms, Mat lab Source Code”, “Soft Computing Methodologies for Cluster Analysis & Gene Prediction”, Published by LAP LAMBERT Academic Publishing, Germany.\n\nPresented / Published 73 Research papers at the National / International Seminars / Conferences; Delivered 104 Guest Lectures on IT / ITES / Management / Analytics / AI & ML at various Institutions / Universities across India. Member & Advisor for Computer Society of India (CSI), Indian Society for Technical Education (ISTE), Indian Statistical Institute , Kolkatta, ICT Academy, IIPS Society, Analytics Society of India, BCIL – New Delhi\n…see more",
      "skills": [
        "Data Analytics\nData Analytics",
        "Marketing Analytics\nMarketing Analytics"
      ],
      "experience": "University Program Manager - India, Salesforce \nUniversity Program Manager - India, Salesforce\nSalesforce · Full-time\nSalesforce · Full-time\nJan 2022 - Present · 3 yrs 9 mos\nJan 2022 to Present · 3 yrs 9 mos\nBangalore Urban, Karnataka, India\nBangalore Urban, Karnataka, India\nUniversity Program for the Premier Universities, Institutes of National Importance, Technological Institutions, Health Universities, Business Schools and other Institutions which are Salesforce Customer sites.\nDriving the Career Recharge Program (CRP) for the Professionals, Academia students and Alumni on Salesforce Technologies\nEffectively creating a resource of Trainers through Educators Empowerment program (EEP) to train the Engineering, University and College faculty on various Salesforce Technologies such as Salesforce Developer, Administrator and Business Analyst\nPlaying pivotal role in integrating Salesforce Technologies as a part of Engineering mainstream curriculum as Professional Electives / Career Electives / Ability Enhancement Program / Value - Add or Add-on Programs\nSetting up and execution of Center of Excellence (CoE) for Training & Certification, Curriculum Integration, Faculty Development Program, Student Mentorship Program, Student Campus Ambassador Program.\nDesign the Curriculum on Various Salesforce Technologies such as Salesforce Developer, Administrator, Business Analyst, MuleSoft and Salesforce AI with Data Cloud and obtain the NOS alignment for the skilling initiatives at the Indian Universities\nCreating a Talent Pipeline in Salesforce Ecosystem for the Partners and Customers in their Business growth and success.\nAdvisor for the Digitization of the Indian Universities with Salesforce Technologies Salesforce Edu Cloud, Tableau etc\nPromotion and exploring opportunities for the Skilled resources in Salesforce Technologies through Confederation of Indian Industry (CII), Federation of Indian Chambers of Commerce and Industry (FICCI), ASOCHAM etc.\nWorked on Salesforce Diversity and Inclusion initiatives(D&I) for Training - People with Disability, Women back to work and Training the LGBTQ individuals.",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    }
  ],
  "current_index": 9,
  "total_urls": 100,
  "timestamp": 1757864796.0790982
}