{
  "scraped_data": [
    {
      "lead_id": "ACoAAABFDBgBAuczLa0MDB7ncUsBu547qGeatkc",
      "name": "Carlos G.",
      "title": "Director, Head of Digital Business\nDirector, Head of Digital Business",
      "location": "Madrid, Community of Madrid, Spain",
      "profile_url": "https://www.linkedin.com/in/ACoAAABFDBgBAuczLa0MDB7ncUsBu547qGeatkc",
      "bio": "Head of Digital Business\nHumanist leader with broad experience working in a global environment and international multicultural teams. Connectedness, empathy, arranger, futuristic and responsibility are my main strengths as leader.\n\nI have strong passion for Digital Transformation, including Digital Customer Experience, Digital Commerce, Digitalisation, Digital Marketing, Artificial Intelligence, Machine Learning, Digital Design, Mobile, Cognitive Systems, Big Data, Innovation, Strategic Visioning, and development of Business Models & Strategies.\n\nI am currently working with digital transformation of sales and e-business globally, accelerating digital culture and enabling global markets to grow.\n\nSpecialities: e-business, e-commerce, digitalisation, digital transformation, digitalisation, business transformation, business models, innovation, web strategy, artificial intelligence, cognitive systems, big data, global supply chain, industry 4.0, business development, sales business processes, governance processes, customer service, value-based selling, search technology, web technologies, master data management, taxonomies, social network analysis, mobile technology, emerging technologies.",
      "skills": [
        "Inteligencia artificial\nInteligencia artificial",
        "IA generativa para la gestión del rendimiento\nIA generativa para la gestión del rendimiento"
      ],
      "experience": "Director, Head of Digital Business\nDirector, Head of Digital Business\nDanfoss · Full-time\nDanfoss · Full-time\nJun 2022 - Present · 3 yrs 4 mos\nJun 2022 to Present · 3 yrs 4 mos\nIntegración de equipos, Negociación and +7 skills",
      "company_name": "Danfoss · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3260/"
    },
    {
      "lead_id": "ACoAACG35zEBA0hUDU5S9J5t8ne5BJmlMfibVec",
      "name": "Anisha Mohanta",
      "title": "QA Consultant\nQA Consultant",
      "location": "Bengaluru, Karnataka, India",
      "profile_url": "https://www.linkedin.com/in/ACoAACG35zEBA0hUDU5S9J5t8ne5BJmlMfibVec",
      "bio": "QA Consultant at Salesforce | Ex-Accenture | 6x Salesforce Certified",
      "skills": [
        "Salesforce Sales Cloud\nSalesforce Sales Cloud",
        "System Testing\nSystem Testing"
      ],
      "experience": "QA Consultant\nQA Consultant\nSalesforce · Full-time\nSalesforce · Full-time\nJul 2024 - Present · 1 yr 3 mos\nJul 2024 to Present · 1 yr 3 mos\nBengaluru, Karnataka, India · Hybrid\nBengaluru, Karnataka, India · Hybrid",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAATuENUBuHKrNsg_pQwONOWDUbhaR7ESNpo",
      "name": "Brent Pohl",
      "title": "MuleSoft\nMuleSoft",
      "location": "Austin, Texas, United States",
      "profile_url": "https://www.linkedin.com/in/ACoAAATuENUBuHKrNsg_pQwONOWDUbhaR7ESNpo",
      "bio": "Regional Vice President at MuleSoft, A Salesforce Company\nCompanies spend over $400 billion dollars a year addressing integration challenges, and the problem of connectivity is only becoming more complex. MuleSoft provides the only unified platform to connect every application, data, and device quickly, easily, and for scale. Our mission is to help organizations change and innovate faster by making it easy to connect the world's applications, data, and devices.\n\nThat's why more than 3,000 of the world's leading enterprises leverage MuleSoft's Anypoint Platform to realize an order of magnitude improvement in their overall speed and agility.\n\nBusiness Automation I Analytics I Mobile I eCommerce I Cloud Migration I SaaS Integration I Digital Transformation I Artificial Intelligence I Robotic Process Automation\n…see more",
      "skills": [
        "Business Development\nBusiness Development",
        "Sales\nSales"
      ],
      "experience": "MuleSoft\nMuleSoft\n7 yrs\n7 yrs\nRegional Vice President - Mid-Market Business, Consumer and Business Services\nRegional Vice President - Mid-Market Business, Consumer and Business Services\nFull-time\nFull-time\nFeb 2023 - Present · 2 yrs 8 mos\nFeb 2023 to Present · 2 yrs 8 mos\nI have responsibility for our Consumer and Business Services Mid-Market business for the US. My role is to enable our customers to change and innovate faster by making it easy for them to unlock data from any system to deliver critical, time-sensitive projects on time in support of their customers. MuleSoft’s market-leading Anypoint Platform coupled with an API-led approach to connectivity is enabling organizations in more than 60 countries realize an order of magnitude improvement in their overall speed and agility. Empowering our customers to compete, innovate and transform.\nRegional Vice President - Commercial Business, Consumer and Business Services\nRegional Vice President - Commercial Business, Consumer and Business Services\nFull-time\nFull-time\nFeb 2022 - Present · 3 yrs 8 mos\nFeb 2022 to Present · 3 yrs 8 mos\nAustin, Texas, United States\nAustin, Texas, United States\nKey Account Executive\nKey Account Executive\nFeb 2021 - Feb 2022 · 1 yr 1 mo\nFeb 2021 to Feb 2022 · 1 yr 1 mo\nAustin, Texas, United States\nAustin, Texas, United States\nShow all 4 experiences",
      "company_name": "7 yrs",
      "company_page_url": "https://www.linkedin.com/company/64251/"
    },
    {
      "lead_id": "ACoAACE7sNgB9_1cOmBpgwWrBgtdBMslxE1LFis",
      "name": "Giulia Eleonora Consiglio",
      "title": "PR & Social Media Manager - Italy\nPR & Social Media Manager - Italy",
      "location": "Milan, Lombardy, Italy",
      "profile_url": "https://www.linkedin.com/in/ACoAACE7sNgB9_1cOmBpgwWrBgtdBMslxE1LFis",
      "bio": "PR & Social Media Manager\nPassionate about strategic communications and creative storytelling, I work as PR & Social Media Manager in a leading online review company. I am responsible for developing and implementing integrated PR campaigns, building bridges between internal data, digital channels and traditional media to enhance transparency and trust between companies and consumers.\n\nMy experience ranges from creating original content to optimizing social performance and activating thought leadership on LinkedIn. I have a passion for stories that create impact, whether expressed through posts, articles or integrated multichannels campaigns.\n\nWhenever I have to face a new challenge, I ask myself: \"What would Don Draper do?\".\n…see more",
      "skills": [
        "Lingua tedesca\nLingua tedesca",
        "Lingua inglese\nLingua inglese"
      ],
      "experience": "PR & Social Media Manager - Italy\nPR & Social Media Manager - Italy\nTrustpilot · Full-time\nTrustpilot · Full-time\nJan 2025 - Present · 9 mos\nJan 2025 to Present · 9 mos\nMilano, Lombardia, Italia\nMilano, Lombardia, Italia\nResponsabile della strategia PR e social per il mercato italiano di Trustpilot. Mi occupo dello sviluppo di campagne integrate, valorizzando i dati proprietari, e della gestione della presenza LinkedIn per rafforzare la brand reputation.",
      "company_name": "Trustpilot · Full-time",
      "company_page_url": "https://www.linkedin.com/company/862573/"
    },
    {
      "lead_id": "ACoAABSq1F0BXrC6tZF_UrhC340r58jnfHsDLlk",
      "name": "Ankit Gupta",
      "title": "Senior Quality Assurance Engineer\nSenior Quality Assurance Engineer",
      "location": "Mumbai, Maharashtra, India",
      "profile_url": "https://www.linkedin.com/in/ACoAABSq1F0BXrC6tZF_UrhC340r58jnfHsDLlk",
      "bio": "Senior Quality Analyst | 2X Ranger | Senior Salesforce QA | Salesforce Functional Consultant | Test Tribe Champions | Senior Quality Engineer |Automation Tester\nUnderstanding Sales Cloud,Service Cloud Marketing Cloud and CPQ requirements.\n• Creating Test plan, Test Scripts based on the Business Requirements Specification documents\n• Sending for Test case review to Developers and Business Analyst.\n• Executing the Test scripts in QA Environment. Testing Email to case creation functionality.\n• Testing Lead version to opportunities functionality. Testing third party application installed in\nsalesforce like DocuSign, Conga,\n• Interact with various Business Analysts and Developers for better understanding of test plan and\nstrategies based on the requirements of the business.\n• Executing Test Cases in QC and logging defects. Prepare documentations like Testing Progress, Test\ncoverage and providing status to Project Manager.\n• Recommend some enhancement features to the system. Helping the Business team in carrying out\nthe User Acceptance Testing.\n• Involved in Retest and Regression Testing, Performing UI Testing and Functionality Testing.\n• Testing with multiple profile users.\n• Conducting KT Session to the new hire members. Attending regular meetings with BA's and internal\nTeam for KT and Status meeting\n…see more",
      "skills": [
        "Artificial Intelligence (AI)\nArtificial Intelligence (AI)",
        "Project Management\nProject Management"
      ],
      "experience": "Senior Quality Assurance Engineer\nSenior Quality Assurance Engineer\nGlobant · Full-time\nGlobant · Full-time\nJun 2025 - Present · 4 mos\nJun 2025 to Present · 4 mos\nIndia\nIndia\n helped me get this job\nLinkedIn helped me get this job\nTest Planning & Execution: Design, develop, and execute test cases for functional, regression, integration, and end-to-end testing within Salesforce platforms (Salesforce Industries, CPQ, Sales, Service, and Community Clouds).\nDefect Management: Identify, report, and manage defects using tools like JIRA, Azure DevOps, and Octane. Track defects through resolution and ensure proper defect triage.\nCollaboration: Work closely with developers, business analysts, and other stakeholders to gather requirements and ensure comprehensive test coverage. Participate in daily scrums, sprint reviews, and retrospectives.\nUAT Support: Provide support during User Acceptance Testing (UAT) and assist in defect management, ensuring the system meets user needs and business requirements.\nAPI & UI Testing: Perform API testing using tools such as Postman and Soap UI. Conduct UI testing using Figma for optimal user interface functionality.\nTest Reporting & Documentation: Maintain test documentation, including test case execution results, test coverage, and defect status. Provide clear and concise test reports to stakeholders.\nAutomation Support: Collaborate with automation teams, assist in test case reviews, and support automation efforts when necessary.\nSQL Testing: Develop and execute SQL queries to validate data integrity and verify proper database operations.\nContinuous Improvement: Stay updated on the latest Salesforce features and testing tools, bringing forward new methodologies and best practices to improve the testing process.\nSalesforce Admin, Salesforce CPQ and +14 skills",
      "company_name": "Globant · Full-time",
      "company_page_url": "https://www.linkedin.com/company/8141/"
    },
    {
      "lead_id": "ACoAABpipTUB6_2elmNtzVs8v0WMUfTFoaKdbos",
      "name": "Alice T.",
      "title": "Salesforce\nSalesforce",
      "location": "Singapore",
      "profile_url": "https://www.linkedin.com/in/ACoAABpipTUB6_2elmNtzVs8v0WMUfTFoaKdbos",
      "bio": "Strategic Sales Director, Agentforce (AI Agents by Salesforce) 🤖🚀\n/ 𝗧𝗲𝗰𝗵𝗻𝗼𝗹𝗼𝗴𝘆 𝗘𝗻𝘁𝗵𝘂𝘀𝗶𝗮𝘀𝘁 \n// 𝗗𝗶𝗴𝗶𝘁𝗮𝗹 𝗦𝘁𝗿𝗮𝘁𝗲𝗴𝗶𝘀𝘁\n/// 𝗜𝗻𝗻𝗼𝘃𝗮𝘁𝗼𝗿\n\n/\nI'm a self-driven and passionate evangelist of emerging digital technology, with a proven track record in establishing enterprise technology initiatives to support the business strategies and define business vision across a wide range of industries and geographies.\n\n//\nI offer consultancy for enterprises to define, articulate and execute company digital strategies across groups of Information Technology, Marketing, Digital, Commerce, Customer Service and Applications. It is with the ultimate goals to help companies shaping customer experience and driving business growth.\n\n///\n'Think about tomorrow's strategies by today.' Innovation is not a one-time thing, I am reminding myself to continuously reach above and beyond what I have done, so as to stay innovative and competitive.\n…see more",
      "skills": [
        "Marketing\nMarketing",
        "Presentation Skills\nPresentation Skills"
      ],
      "experience": "Salesforce\nSalesforce\n5 yrs 6 mos\n5 yrs 6 mos\nStrategic Sales Director, Agentforce\nStrategic Sales Director, Agentforce\nMar 2025 - Present · 7 mos\nMar 2025 to Present · 7 mos\nSingapore\nSingapore\n𝗔𝗰𝗵𝗶𝗲𝘃𝗲𝗺𝗲𝗻𝘁𝘀:\n- Awarded as a Salesforce Peak Performer, consistently overachieving:\n*FY25 with 109% attainment\n*FY24 with 244% attainment\n*FY23 with 247% attainment\n*FY22 with 192% attainment\n*FY21 with 202% attainment\n\n- Closed customer logos across ASEAN & GCR in sectors including BFSI, retail & consumer goods, travel & hospitality, healthcare, property development, telecommunication and more.\n\n- Collaborated with 100+ customers to develop and execute digital transformation strategies, so as to drive the business growth across all customer 360 touchpoint.\nSales Director, Salesforce Digital\nSales Director, Salesforce Digital\nFull-time\nFull-time\nApr 2022 - Feb 2025 · 2 yrs 11 mos\nApr 2022 to Feb 2025 · 2 yrs 11 mos\nSingapore\nSingapore\nAccount Manager, Salesforce Digital\nAccount Manager, Salesforce Digital\nFull-time\nFull-time\nApr 2020 - Mar 2022 · 2 yrs\nApr 2020 to Mar 2022 · 2 yrs\nHong Kong\nHong Kong",
      "company_name": "5 yrs 6 mos",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAAUIPgMBDmP2zoLX7A1ZWwktp2Rvkmbh9rw",
      "name": "Piyush Singhal",
      "title": "Chief Executive Officer\nChief Executive Officer",
      "location": "Concord, Ontario, Canada",
      "profile_url": "https://www.linkedin.com/in/ACoAAAUIPgMBDmP2zoLX7A1ZWwktp2Rvkmbh9rw",
      "bio": "Co-founder | CEO – Docs Made Easy | Salesforce Consultant | AppExchange Strategist | ITIL Certified\nAn outcome-oriented technology leader with a global outlook, Piyush has over 10 years of experience in Project Execution, SDLC Planning, Salesforce, CRM, Salesforce Mobile, and Force.com.\n\nA seasoned Salesforce professional, Piyush started HIC Global Solutions after filling senior development positions at frontrunning company names in the Salesforce development industry.\n\nHIC Global solutions is a proud partner of Salesforce with a large number of successful projects, and delighted clients the world over. Besides this, the company fosters an ingrained culture of social consciousness, and also a 1% Pledge Partner, contributing further to social responsibility.\n\nHe's known for his winning strategic direction, his hands-on approach, a proven track record, and global outreach.\n\nHe looks forward to with challenging Salesforce development tasks, delivering novel apps for AppExchange listings, and forging global partnerships through working with the passionate people behind them.\n\nPiyush is also a Mountaineering enthusiast & loves taking part in national & international marathons.\n…see more",
      "skills": [
        "Docs Made Easy\nDocs Made Easy",
        "Team Management\nTeam Management"
      ],
      "experience": "Chief Executive Officer\nChief Executive Officer\nDocs Made Easy · Permanent Full-time\nDocs Made Easy · Permanent Full-time\nApr 2021 - Present · 4 yrs 6 mos\nApr 2021 to Present · 4 yrs 6 mos\nUnited States · On-site\nUnited States · On-site\n• Spearheaded the development of Docs Made Easy, an innovative document automation app, ensuring it is simple, secure, and free for users. \n• Established HIC Global Solutions as a leading Salesforce consulting partner, focusing on social responsibility and impactful technology solutions.\n• Engaged deeply in product strategy and customer feedback, driving AppExchange innovations that enhance user experience and operational efficiency.",
      "company_name": "Docs Made Easy · Permanent Full-time",
      "company_page_url": "https://www.linkedin.com/company/67265286/"
    },
    {
      "lead_id": "ACoAAAGTxj0BY-nh1eUHw55-tm5o3-WA7hVfz24",
      "name": "🟢 Alejandro Catalan",
      "title": "Customer Success Manager\nCustomer Success Manager",
      "location": "Greater Sydney Area",
      "profile_url": "https://www.linkedin.com/in/ACoAAAGTxj0BY-nh1eUHw55-tm5o3-WA7hVfz24",
      "bio": "Customer Success Manager | Digital Transformation | Digital Marketing | SaaS | CX\nI'm driven by a genuine interest in people and consumers and their motivations, excited by the evolution of media, passionate about delivering insights-based ideas, focused on the development of campaigns that aim to achieve measurable goals and drive business results.\n\nWith over 13 years of experience, I have worked across a vast range of industries.\n\n\nhttps://trailblazer.me/id/acatalan78\n…see more",
      "skills": [
        "Business Strategy\nBusiness Strategy",
        "Business Operations\nBusiness Operations"
      ],
      "experience": "Customer Success Manager\nCustomer Success Manager\nSalesforce · Full-time\nSalesforce · Full-time\nOct 2024 - Present · 1 yr\nOct 2024 to Present · 1 yr\nSydney, New South Wales, Australia · Hybrid\nSydney, New South Wales, Australia · Hybrid\nCustomer Success Manager - Signature Customers (Marketing Cloud, Commerce), part of the Customer Success Group (CSG) ensuring our customer's success using Salesforce technology and solutions.\nDigital Marketing, Direct Marketing and +13 skills",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAClaZrsBkmgP9uNopdA2LEAVqAtUGa3f58c",
      "name": "Najla Fayaz",
      "title": "Account Manager\nAccount Manager",
      "location": "United States",
      "profile_url": "https://www.linkedin.com/in/ACoAAClaZrsBkmgP9uNopdA2LEAVqAtUGa3f58c",
      "bio": "Account Manager | Salesforce® and Certinia Implementation Consulting\nAt AblyPro, our team offers bespoke Salesforce® solutions, facilitated by my account management and active listening skills honed through my MBA studies. We specialize in PSA, ERP, and Service Cloud solutions, tailored to exceed business expectations.\nAt AblyPro, our team offers bespoke Salesforce® solutions, facilitated by my account management and active listening skills honed through my MBA studies. We specialize in PSA, ERP, and Service Cloud solutions, tailored to exceed business expectations.",
      "skills": [
        "Account Management\nAccount Management",
        "Team Management\nTeam Management"
      ],
      "experience": "Account Manager\nAccount Manager\nAblyPro · Full-time\nAblyPro · Full-time\nJul 2024 - Present · 1 yr 3 mos\nJul 2024 to Present · 1 yr 3 mos\nMaryland, United States\nMaryland, United States\nAblyPro is a registered Salesforce® and Certinia Implementation Consulting Partner. We are your go-to team of professionals, ready to offer comprehensive PSA, ERP, and Service Cloud solutions that go beyond just meeting your business needs.",
      "company_name": "AblyPro · Full-time",
      "company_page_url": "https://www.linkedin.com/company/71543827/"
    },
    {
      "lead_id": "ACoAAAaM8s0B2a-Ql27dDQ_yTrXuhuElNm46tjI",
      "name": "Brenda R.",
      "title": "Regional Director, Strategic Business Practices - Deal Strategy & Pricing\nRegional Director, Strategic Business Practices - Deal Strategy & Pricing",
      "location": "United States",
      "profile_url": "https://www.linkedin.com/in/ACoAAAaM8s0B2a-Ql27dDQ_yTrXuhuElNm46tjI",
      "bio": "Regional Director | Strategy & Growth Leader Across Tech, Automotive & CPG | Building Scalable GTM & Monetization Models | Board Advisory with Execution Depth\nI’m a strategic business leader with a passion for building what doesn’t yet exist - new strategies, new markets, new ways of working - and turning them into measurable outcomes. My experience spans technology, consumer goods, automotive, and manufacturing, and I’ve led regional and global teams through complex transformations, growth initiatives, and operational reinvention.\n\nWhat defines my path is not just advising on strategy, but owning it, leading from within, with full accountability for results. I’ve run business units, shaped go-to-market models, built pricing and monetization frameworks, and improved commercial governance to help companies grow smarter and scale sustainably.\n\nToday at Salesforce, I lead Strategic Business Practices for the Americas. My focus is on enabling scalable, high-impact deal strategy across fast-paced, high-growth markets. I work closely with sales, finance, legal, and operations to make complex deals simpler, faster, and more profitable and to ensure our pricing models and governance structures support long-term value, not just short-term wins.\n\nThroughout my career, I’ve helped global organizations unlock margin, expand regionally, and lead cross-functional transformations. I know how to navigate ambiguity, build alignment across diverse stakeholders, and turn competing interests into common purpose. Whether in boardrooms, frontline operations, or cross-border initiatives, I’m drawn to complexity and to making it actionable.\n\nBut beyond strategy and execution, I care deeply about how we lead. As a woman who has thrived in industries and environments that weren’t always designed to support equity, I understand the cost of success when cultures are misaligned. That’s why I work to create healthier leadership models, ones that allow women to grow without burning out, and where diversity is not just welcomed, but recognized as essential to performance. Through my advisory work with the Women Economic Forum, I help elevate diverse voices in leadership and push for the cultural shifts that organizations need to stay relevant and human.\n\nI believe in business as a platform to create both value and change and I’m always open to connecting with others who share that mindset.\n\nLet’s talk if you’re building something bold, evolving how your company sells or operates, or just looking to bring more clarity to complexity.\n…see more",
      "skills": [
        "Revenue & Profit Growth\nRevenue & Profit Growth",
        "Monetization\nMonetization"
      ],
      "experience": "Regional Director, Strategic Business Practices - Deal Strategy & Pricing\nRegional Director, Strategic Business Practices - Deal Strategy & Pricing\nSalesforce · Full-time\nSalesforce · Full-time\nJun 2025 - Present · 4 mos\nJun 2025 to Present · 4 mos\nRevenue & Profit Growth and Monetization",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAADOtREkBKHz5tZqpGmvFsh_9917hOHGKYRw",
      "name": "Artemiza-Delia Asanache",
      "title": "Salesforce Consultant\nSalesforce Consultant",
      "location": "Bucharest, Romania",
      "profile_url": "https://www.linkedin.com/in/ACoAADOtREkBKHz5tZqpGmvFsh_9917hOHGKYRw",
      "bio": "Salesforce Consultant | 6 x Salesforce Certified | Double Star Ranger | PSM 1\nExperienced CRM Specialist, passionate about technology, with highly developed verbal and written communication skills, result oriented, able to work in diverse and multicultural environments.\nExperienced CRM Specialist, passionate about technology, with highly developed verbal and written communication skills, result oriented, able to work in diverse and multicultural environments.",
      "skills": [
        "Time Management\nTime Management",
        "Sales Processes\nSales Processes"
      ],
      "experience": "Salesforce Consultant\nSalesforce Consultant\nAccenture · Full-time\nAccenture · Full-time\nApr 2021 - Present · 4 yrs 6 mos\nApr 2021 to Present · 4 yrs 6 mos\nBucharest, Romania\nBucharest, Romania\n▪ Engaging with client stakeholders for new requirement gathering or refining existing ones\n▪ Define the functional & technical solutions together with technical delivery team\n▪ Configure SFDC platform to meet business process and application requirements\n▪ Document detailed business, functional & technical requirements\n▪ Work closely with technical team on planning the functionalities release\n▪ Coordinate with Application Architect to ensure the proposed solutions are inline with the architecture\n▪ Perform testing activities (system test, integration test & UAT) and follow-up on bug fixing\n▪ Develop demos and trainings for client stakeholders\n▪ Actively participating in Agile Delivery (SCRUM) models in all their phases\n…see more",
      "company_name": "Accenture · Full-time",
      "company_page_url": "https://www.linkedin.com/company/1033/"
    },
    {
      "lead_id": "ACoAACADczoBFxbKSGP3CIn3cZFy8lSpZNbycLA",
      "name": "Logesh Matheswaran",
      "title": "Technical Consultant\nTechnical Consultant",
      "location": "Bengaluru, Karnataka, India",
      "profile_url": "https://www.linkedin.com/in/ACoAACADczoBFxbKSGP3CIn3cZFy8lSpZNbycLA",
      "bio": "Technical Consultant at Salesforce | TDX25 & Community Speaker | Creator of Formulizer | Co-Creator of ApexPulse (AppExchange) | Salesforce Credentials Ambassador | Salesforce Insider | Five Star Agentblazer\nSelf-taught Salesforce Developer - Administrator - Consultant (Multi-Cloud) with 5+ years of experience in Salesforce Agentforce, AppExchange, AgentExchange, Customizations, Configurations, Flows, Integrations, Omnistudio (Integration Procedures, Datamappers, Flexcards, and Omniscripts) and Development (Apex, Visualforce, Aura, and LWC). Slack and Heroku (In Learning Radar).\n\n\n📌 My Cool Salesforce Stuffs: https://gist.github.com/Logeshm72\n\n📌 Co-creator of Salesforce AppExchange product named \"Apex Pulse\" - https://appexchange.salesforce.com/appxListingDetail?listingId=a0NHu00000ozRJvMAM\n\n📌 Contributed to Salesforce Prompt Builder Template, Agentforce for Service, Dashboard Insights for Agentforce Readiness and Report Administration for Agentforce Readiness Superbadge Units.\n\n📌 Creator of Formulizer - https://formulizer-dev-ed.develop.my.site.com/formulizer/s/\n\n📌 Salesforce Insider - https://careers.salesforce.com/en/salesforce-stories/culture-connection/talk-to-an-insider-connecting-with-employees-during-the-salesforce-interview-process/\n…see more",
      "skills": [
        "Slaesforce\nSlaesforce",
        "DataCloud\nDataCloud"
      ],
      "experience": "Technical Consultant\nTechnical Consultant\nSalesforce · Full-time\nSalesforce · Full-time\nFeb 2024 - Present · 1 yr 8 mos\nFeb 2024 to Present · 1 yr 8 mos\nBengaluru, Karnataka, India · Hybrid\nBengaluru, Karnataka, India · Hybrid\nPart of Salesforce - Global Delivery Center (GDC) - Professional Services.\n\n💼 Working in the Salesforce Communications Cloud space.\n🌟 Multi-Cloud Expertise - Sales, Service, Community, Data, Education, Agentforce and Platform Clouds.\n🛠 Tech Stack - All Point & Click Configurations, Omnistudio - IP, DM, OS, FC, LWC, Apex, Flows, and Integrations.\n🔄 Deployments - Git, VS Code, Gearset, ChangeSet and DevOps Center.\n🏅 Received Achiever's Award - June 2024 for exemplary performance in the project.\n📌 Co-creator of Salesforce AppExchange product named \"Apex Pulse\".\n❇️ Salesforce Credentials Ambassador.\n🏅 Received Pat On The Back Award.\n🌟 Creator of Formulizer.\n🏅 Received Trailblazer Award - FY25 Q3.\n🤝 Salesforce Insider.\n🧑‍🤝‍🧑 Part of \"The Salesforce Commons\" - Contributed a little to the Salesforce Membership Essentials Open Source Project.\n💡 Presented an insightful session on \"Package Actions, Topics & Prompt Templates for AgentExchange\" at TDX25 India - Bengaluru.\nAgentforce, Salesforce Education Cloud and +7 skills\n+3",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAB3wdY8BzGavWqX4hoUekiwHe8lqSW8Si74",
      "name": "Stuart Stretch",
      "title": "Global Alliances Director\nGlobal Alliances Director",
      "location": "Chester, England, United Kingdom",
      "profile_url": "https://www.linkedin.com/in/ACoAAB3wdY8BzGavWqX4hoUekiwHe8lqSW8Si74",
      "bio": "Global Alliances Director at GoCardless | Payment Geek\nHighly experienced Payments Consultant with a proven record assisting corporate clients to achieve higher levels of automation, reducing operational costs and enhancing the customer experience at all stages of the payment process.\n\nI specialise in Direct Debit, Card Processing and E-commerce solutions.\n…see more",
      "skills": [
        "Cross-functional Coordination\nCross-functional Coordination",
        "Partnership Development\nPartnership Development"
      ],
      "experience": "Global Alliances Director\nGlobal Alliances Director\nGoCardless · Full-time\nGoCardless · Full-time\nJan 2021 - Present · 4 yrs 9 mos\nJan 2021 to Present · 4 yrs 9 mos\nLondon, England, United Kingdom\nLondon, England, United Kingdom\nAt GoCardless we believe bank payments are the best way to pay and get paid. And bank account data is a powerful tool for businesses to make better, faster decisions. So we’re making it easy to use both.\n\nCollect payments – domestic or international – without the chasing, stress, or expensive fees. And securely access data from your customers’ bank accounts to enhance your products and manage risk, with connections available to 2,300+ banks across Europe.\n\n85,000+ businesses around the world trust us to power their payments.\n\nSee how we can help you at gocardless.com.\nSaaS Sales, Commercial Planning and +27 skills",
      "company_name": "GoCardless · Full-time",
      "company_page_url": "https://www.linkedin.com/company/2808012/"
    },
    {
      "lead_id": "ACoAAAbC_YkBwuNLAhHPBRXJeZ4wOtjC6NATvEE",
      "name": "Ghita MECHTI 🇵🇸",
      "title": "Consultante Salesforce\nConsultante Salesforce",
      "location": "Argenteuil, Île-de-France, France",
      "profile_url": "https://www.linkedin.com/in/ACoAAAbC_YkBwuNLAhHPBRXJeZ4wOtjC6NATvEE",
      "bio": "Consultante Salesforce chez TALAN\nCRM: SalesForce |\nETL : Talend, SSIS |\nMéthode de la gestion de projet : Agile |\nModélisation: Merise ,UML |\nTraitement d'image : Adobe photosshop | Adobe Illustrator |\nCMS : Joomla, Wordpress |\nTechnologies du Web: HTML5/CSS |\nMicrosoft Office |\nGestion de la base de données: MySql | SqlServer, SOQL(Salesforce) |\n…see more",
      "skills": [
        "Requirements Gathering\nRequirements Gathering",
        "Analytical Skills\nAnalytical Skills"
      ],
      "experience": "Consultante Salesforce\nConsultante Salesforce\nTalan · Permanent\nTalan · Permanent\nOct 2022 - Present · 3 yrs\nOct 2022 to Present · 3 yrs\nParis et périphérie · Hybrid\nParis et périphérie · Hybrid\nClient : BPCE\n• Participation active aux réunions de recueil des besoins aux côtés de la personne en charge du cadrage métier. Lors de certains ateliers, les utilisateurs métiers étaient sollicités pour clarifier et valider les besoins exprimés, ce qui m’a permis de mieux comprendre les règles de gestion et d’assurer une bonne adéquation des solutions proposées.\n• Contribution à la réorganisation et à la réécriture des User Stories, ainsi qu’à la maturation des besoins existants pour garantir leur complétude et leur cohérence avec les enjeux métiers.\n• Développement de tickets (User Stories) dans Salesforce, et ponctuellement via Talend, en fonction des besoins d’intégration ou de traitement de données.\n• Rédaction des cas de tests associés et réalisation des tests unitaires en amont de la livraison aux testeurs QA.\n• Participation à la gestion des déploiements en jouant, par rotation, le rôle de Release Manager durant une phase de transition vers un processus CI/CD automatisé.\n• Analyse et challenge des demandes métiers afin de proposer des solutions IT pertinentes et adaptées aux contraintes techniques et fonctionnelles.\n• Rédaction des spécifications fonctionnelles détaillées à destination des équipes de développement et accompagnement dans la compréhension des travaux à réaliser.\n• Élaboration et exécution des plans de tests fonctionnels, suivi des tests utilisateurs (UAT), gestion des retours et contrôle de la qualité des livrables.\n• Communication régulière sur l’état d’avancement des tâches, partage des connaissances au sein de l’équipe, et appui au Product Owner pour la priorisation du backlog.\n• Réalisation d’analyses critiques sur l’existant et proposition de pistes d’amélioration ou de solutions innovantes pour optimiser les processus et outils utilisés.\nOffice 365",
      "company_name": "Talan · Permanent",
      "company_page_url": "https://www.linkedin.com/company/28542/"
    },
    {
      "lead_id": "ACoAAE2ZB0wBrBKsH_T0xSf_3_snDUwrOZZDwVM",
      "name": "Lakshmi Narayana",
      "title": "HireRight\nHireRight",
      "location": "Bengaluru, Karnataka, India",
      "profile_url": "https://www.linkedin.com/in/ACoAAE2ZB0wBrBKsH_T0xSf_3_snDUwrOZZDwVM",
      "bio": "Salesforce Marketing Cloud Developer| Salesforce Developer lSalesforce Adminl 12 X Salesforce Certified l 4X Trailhead Ranger⭐⭐⭐⭐ I Salesforce Enthusiast I Agentblazer Innovator I Exploring Data Cloud -AI",
      "skills": [
        "Data Models\nData Models",
        "Data Spaces\nData Spaces"
      ],
      "experience": "HireRight\nHireRight\nFull-time · 17 yrs 10 mos\nFull-time · 17 yrs 10 mos\nBengaluru, Karnataka, India\nBengaluru, Karnataka, India\nSFMC \nSFMC\nDec 2007 - Present · 17 yrs 10 mos\nDec 2007 to Present · 17 yrs 10 mos\nOn-site\nOn-site\nSSJS and SQL\nConsultant\nConsultant\nJan 2011 - Apr 2024 · 13 yrs 4 mos\nJan 2011 to Apr 2024 · 13 yrs 4 mos",
      "company_name": "Full-time · 17 yrs 10 mos",
      "company_page_url": "https://www.linkedin.com/company/10234/"
    },
    {
      "lead_id": "ACoAAABtYckB0rZ0l4VxW-28SjAzYxZEKRejerA",
      "name": "Cyril LOUIS ☁",
      "title": "CEO & Co-Founder\nCEO & Co-Founder",
      "location": "Geneva, Geneva, Switzerland",
      "profile_url": "https://www.linkedin.com/in/ACoAAABtYckB0rZ0l4VxW-28SjAzYxZEKRejerA",
      "bio": "CEO & Co-Founder at Mavericx | Salesforce MVP & Salesforce Platform Champion\n• CEO & Co-Founder at Mavericx | Customer Experience | Cutting-edge Experience | Cloud Experience\n\n• Digital/CX/CRM/Data Expert | Salesforce Evangelist | AI Enthusiast\n\n• Salesforce MVP | Salesforce Platform Champion | 20x Salesforce Certified | Skiforce.co Co-Organizer | Geneva Salesforce User Group Co-Leader\n\n• 20+ years experience in Digital and in CRM\n\n• Customer Success focused, Result oriented, Team Leader & Mentor\n\n• MBA and Bachelor degrees in Marketing and in IT/Computer Science\n\n• Specialties:\n- Customer Experience: Acquisition, Nurturing, Activation, Engagement, Conversion, Loyalty\n- CX/CRM Expert: Marketing Automation, Sales Force Automation, eCommerce, CMS, Customer Service Support, Business Intelligence and Analytics\n- Marketing: Digital Marketing, Email Marketing, Mobile Marketing, Search Engine Marketing, DMP/CDP\n- Team Management: internal & external resources in international context\n- Customer & Partner Success\n- Solution Architecture: IT vision & roadmap strategy definition to align business expectations and to provide business value, application architecture design, recommendations on how to design and leverage Digital solutions\n- Pre-Sales & Solution Engineering\n- Project Management: Agile methodology (Certified ScrumMaster), Waterfall methodology and 6sigma methodology (SSYB Six Sigma Yellow Belt)\n- Project Sponsor, Product Owner & Product Management\n…see more",
      "skills": [
        "Public Speaking\nPublic Speaking",
        "Salesforce.com\nSalesforce.com"
      ],
      "experience": "CEO & Co-Founder\nCEO & Co-Founder\nMavericx · Full-time\nMavericx · Full-time\nNov 2020 - Present · 4 yrs 11 mos\nNov 2020 to Present · 4 yrs 11 mos\nGeneva, Switzerland\nGeneva, Switzerland\n💫 \"BRINGING PASSION TO LIFE\" - MAVERICX 💫\n\nMavericx deliver innovative and outstanding Customer, Cutting-edge and Cloud Experience with #Salesforce, #UiPath and complementary #Cloud technologies.\n\n▶️ Discover us at www.mavericx.ch ◀️\n\nFeel free to engage with our team to discuss your CX initiatives!\n\n#Mavericx #CX #CustomerExperience #Salesforce #CRM #MarketingAutomation #CuttingEdgeExperience #UiPath #RPA #Automation #CloudExperience\nCustomer Experience, Salesforce and +7 skills",
      "company_name": "Mavericx · Full-time",
      "company_page_url": "https://www.linkedin.com/company/69465918/"
    },
    {
      "lead_id": "ACoAAA60fV8B-jcd0lmER-wwSiJVNRwXNrDg_sA",
      "name": "Nevena Shalamanova",
      "title": "Next Consult \nNext Consult",
      "location": "Bulgaria",
      "profile_url": "https://www.linkedin.com/in/ACoAAA60fV8B-jcd0lmER-wwSiJVNRwXNrDg_sA",
      "bio": "Business Development Manager | Talent Acquisition Hunter - Salesforce Ninjas Wanted",
      "skills": [
        "Sales Cloud\nSales Cloud",
        "Interpersonal Skills\nInterpersonal Skills"
      ],
      "experience": "Next Consult \nNext Consult\nFull-time · 5 mos\nFull-time · 5 mos\nTalent Acquisition Hunter - Salesforce Ninjas Wanted\nTalent Acquisition Hunter - Salesforce Ninjas Wanted\nJul 2025 - Present · 3 mos\nJul 2025 to Present · 3 mos\nBusiness Development Manager\nBusiness Development Manager\nMay 2025 - Present · 5 mos\nMay 2025 to Present · 5 mos",
      "company_name": "Full-time · 5 mos",
      "company_page_url": "https://www.linkedin.com/company/1152813/"
    },
    {
      "lead_id": "ACoAAAyoHQIBhWZZcRxHEDOz2u8KOoe9dJg3Mdo",
      "name": "Tania Contreras Chávez",
      "title": "Mattel Latin America\nMattel Latin America",
      "location": "Mexico City Metropolitan Area",
      "profile_url": "https://www.linkedin.com/in/ACoAAAyoHQIBhWZZcRxHEDOz2u8KOoe9dJg3Mdo",
      "bio": "LATAM Workplace Experience & Shared Services Manager\nVersatile professional with 4 years of experience implementing comprehensive benefits programs across multiple countries while ensuring compliance with local regulations and industry standards. I have fostered strong relationships with HR partners and stakeholders, complemented by an additional 16 years of experience in designing strategies for facilities operations and corporate management for international companies such as Mattel de Mexico, MasterCard, Avaya Communication, General Motors, and Coca-Cola Export. I have a proven track record of optimizing facility efficiency and HR processes, ensuring compliance with regulatory standards, and leading cross-functional teams to achieve operational excellence. My initiatives have enhanced employee satisfaction and well-being while aligning benefits strategies with organizational goals. Proficient in budgeting (OPEX, CAPEX, P&L, and forecasts), vendor management, and emergency preparedness plans (BCP), I am seeking to leverage my expertise and leadership abilities to drive operational excellence in a dynamic organization while ensuring EVP strategies and continuous improvement.\n…see more",
      "skills": [
        "Respuesta ante incidentes\nRespuesta ante incidentes",
        "Creación de relaciones\nCreación de relaciones"
      ],
      "experience": "Mattel Latin America\nMattel Latin America\n7 yrs 1 mo\n7 yrs 1 mo\nMexico City, Mexico\nMexico City, Mexico\nManager COE LATAM\nManager COE LATAM\nApr 2020 - Mar 2024 · 4 yrs\nApr 2020 to Mar 2024 · 4 yrs\nHybrid\nHybrid\nManager Latam Portfolio 6,500 SQM LATAM (Mexico, Brazil, Colombia, Peru, Chile &\nArgentina). Responsible for Facilities & Real Estate, Payroll & Labor, Benefit administration,\naccountable to ensure business continuity, real estate portfolio and facilities, develop strong\nprocesses, operational performance and continuous improvement.\n▪ Desing and implemented Mexico offices strategy, planning, contracts negotiation, bidding and refurbish downsize, ensuring new capacity, CAPEX and general contracts, as a result we delivered efficiencies of 22% in OPEX and 4% utilities. Office closure efficiency 2020 early termination negotiation no penalties involved. Chile New Office, responsible for: develop financial assessment, CAPEX, 5 years project return, P&L, cash flow), lease negotiation, bidding processes general design & general construction contract, and leading cross functional team IT and Security.\n▪ Regional Facility Management, design and implementation strategy, scope and bidding processes\nto achieve simplification of vendor management to one single vendor.\n▪ New model of cafeteria Service, CAPEX, bidding processes, new vendor supplier Grab &\nGo model and implementation.\n▪ Labor & Payroll: landscape payroll implementation (Labor local regulation Outsourcing, Time tracking, Nom-035 and Nom 037). Labor simplification from 5 to one single vendor.\n▪ Benefits: Large and diverse portfolio of benefits including but not limited to Health insurance, Life insurance, Wellbeing (Club), Meal Vouchers, Checkup, responsible for renewals, advisor in scope policies.\nStorytelling, Creación de relaciones and +25 skills\nAssoc Manager Facilities\nAssoc Manager Facilities\nFull-time\nFull-time\nMar 2017 - Apr 2020 · 3 yrs 2 mos\nMar 2017 to Apr 2020 · 3 yrs 2 mos\nOn-site\nOn-site\nAssociate Manager General Services LATAM: Portfolio of 69,594 SQF LATAM responsible for operational soft Services, Hard Services, EH&S, Food Service, Fleet Management, Executive Security.\n▪ Facilities Regional enhance processes, plan to standardize SLAs.\n▪ New model of cafeteria Service, bidding processes, new vendor supplier Grab & Go model and implementation and update Branding at Mattel.\nStorytelling, Creación de relaciones and +27 skills",
      "company_name": "7 yrs 1 mo",
      "company_page_url": "https://www.linkedin.com/company/8855903/"
    },
    {
      "lead_id": "ACoAAAPWRkcB8oJuFa0uWfh-Ozv4BwKzLjQ7DGc",
      "name": "Sushant Joshi",
      "title": "Salesforce\nSalesforce",
      "location": "Mumbai, Maharashtra, India",
      "profile_url": "https://www.linkedin.com/in/ACoAAAPWRkcB8oJuFa0uWfh-Ozv4BwKzLjQ7DGc",
      "bio": "Enterprise Sales || Business Development || Account Director at Salesforce\n20 Years (+) Cross Functional Experience in IT / ITES, Digital Marketing & Software as a Service (SaaS)- Business Operations including B2B/ Direct Sales, Large Account Management, Indirect Channel Sales, Collections, Customer Service Assurance, Service Delivery across sectors.\n\nPROFILES HANDLED\no Director Sales & Consulting – Led the India Region for Digital Marketing Platform Sales\no Region Head (North & West India) for SaaS Startup\no AVP Sales (MEA & India) for a Logistics Automation Platform\no Enterprise Solutions Architect for a Digital Automation Platform\no Sales & Account Management (B2B, Direct Sales) -\no Regional Head IT Delivery - Led Large and Strategic Accounts for (IT/ ITeS, Airline, Manufacturing, Media & BFSI)\no Service Delivery Manager - Central & State Govt Key Accounts (NIC, CRPF, MOF)\n\n• KEY STRENGTHS\no Complete Understanding and Ownership of P&L- $5Mn IT / ITES Business\no Rich & Diversified Experience of handling National Vertical (IT & ITeS) as well as Regional Business (North, West) across multiple domains\no Proven Capability of driving IT/ ITES Business across all categories -Managed Services & Integrated Solutions, Digital Marketing Platform, SaaS, Banking Products like Anti Money Laundering, Treasury & Trading platforms\no Outstanding People Management Skills\no Strong Large Cross Functional Team Management Skills (350 employees across 5 States in functions across managed IT Services, Digital marketing Services etc)\no Versatility in Handling Complete Business Operations (Sales, Pre Sales, Service Delivery, Client Success, PMO, Collections and HR)\no Powerful mix of B2C Direct Sales as well as B2B and B2B2C Profile\no Verifiable Experience of handling Diverse Geographical Areas at Regional Level (5 States) & National Industry Vertical\n…see more",
      "skills": [
        "Vendor Management\nVendor Management",
        "Team Management\nTeam Management"
      ],
      "experience": "Salesforce\nSalesforce\nFull-time · 3 yrs 10 mos\nFull-time · 3 yrs 10 mos\nMumbai, Maharashtra, India\nMumbai, Maharashtra, India\nAccount Director at Salesforce\nAccount Director at Salesforce\nFeb 2024 - Present · 1 yr 8 mos\nFeb 2024 to Present · 1 yr 8 mos\nEnterprise Account Executive || Salesforce Platform Cloud \nEnterprise Account Executive || Salesforce Platform Cloud\nDec 2021 - Feb 2024 · 2 yrs 3 mos\nDec 2021 to Feb 2024 · 2 yrs 3 mos",
      "company_name": "Full-time · 3 yrs 10 mos",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAC6ty0gB8ueeO-_EHb0xRJB58xmaTHygG0M",
      "name": "Gaganpreet Singh",
      "title": "Account Director - India & APAC\nAccount Director - India & APAC",
      "location": "New Delhi, Delhi, India",
      "profile_url": "https://www.linkedin.com/in/ACoAAC6ty0gB8ueeO-_EHb0xRJB58xmaTHygG0M",
      "bio": "Account Director - India & APAC @Maxify Digital, Worlds #1 Full Service Salesforce Managed Marketplace/Transforming Global Aviation & Travel A Hustler/Dreamer/Explorer/StoryTeller\n- 8 years of experience in Sales and Business Development.\n- Worked in 4 organizations which has given me qualities/abilities to handle different styles of communication.\n- Hands-on and extensive experience in Sales, Sales Operations and Business Development, and Client Engagement.\n- Promoted as Account Manager & team lead sales within a 7-month timeframe.\n- Successfully Improved product sales by 12%, which led to a 20% increase in annual revenue, and exceeded department KPIs by 20% for 5 months in a row.\n- Maintained a 97% satisfaction rating over a 24-month period and developed new relationships with over 200 business clients, helping them to solve their business challenges.\n- Awarded as the Sales person of the month for 5 months in a row & played a major role in retaining the majority of clients in the tough time of the pandemic.\n…see more",
      "skills": [
        "Client Relations\nClient Relations",
        "Sales Presentations\nSales Presentations"
      ],
      "experience": "Account Director - India & APAC\nAccount Director - India & APAC\nMaxify Digital · Full-time\nMaxify Digital · Full-time\nJul 2023 - Present · 2 yrs 3 mos\nJul 2023 to Present · 2 yrs 3 mos\nNoida, Uttar Pradesh, India · On-site\nNoida, Uttar Pradesh, India · On-site\nWorld's #1 AI-Powered Salesforce Bespoke Platform\nNo Lengthy SOW, No Hiring Hassle, No Strings Attached. With just a click away, Maxify's AI-enabled digital platform matches you to a Salesforce Expert ready to transform your Salesforce CRM.\nSales, End-to-End Sales and +3 skills",
      "company_name": "Maxify Digital · Full-time",
      "company_page_url": "https://www.linkedin.com/company/13632509/"
    },
    {
      "lead_id": "ACoAAC3cR7wBDbbLkEklPgwfIGKe-KYjS09IPVQ",
      "name": "Rohan Philip Abraham",
      "title": "Tata Technologies\nTata Technologies",
      "location": "Greater Coventry Area",
      "profile_url": "https://www.linkedin.com/in/ACoAAC3cR7wBDbbLkEklPgwfIGKe-KYjS09IPVQ",
      "bio": "Client Partner for Automotive\nIf you are here, might as well sent me a connect! 💯\n\nSupporting the Business Development/ Sales function at Tata Technologies (TTL) for around 4 years. Started engaging in the account management of a British luxury OEM. 🚗🚙\n\nCRM Management, Proposal drafting (RFQ response), Relationship Management.☎📝\n\nHelped TTL target and open new Logos and built relationships with customers in the UK geography. Currently supporting account management of a large automotive green energy solution supplier in the midlands. ⚡🔌💡\n\nLooking to connect with individuals in the automotive industry and its supply chains around the world🗺🌍\n…see more",
      "skills": [
        "Account Management\nAccount Management",
        "Commercials\nCommercials"
      ],
      "experience": "Tata Technologies\nTata Technologies\nFull-time · 4 yrs 2 mos\nFull-time · 4 yrs 2 mos\nAccount Manager\nAccount Manager\nAug 2025 - Present · 2 mos\nAug 2025 to Present · 2 mos\nDetroit, Michigan, United States · On-site\nDetroit, Michigan, United States · On-site\nBid Engineer \nBid Engineer\nJul 2023 - Aug 2025 · 2 yrs 2 mos\nJul 2023 to Aug 2025 · 2 yrs 2 mos\nLeamington Spa, England, United Kingdom · Hybrid\nLeamington Spa, England, United Kingdom · Hybrid\nLed various discussions with internal and external stakeholders.\nManagement of CRM platform (Salesforce).\nCustomer Relationship building and development.\nUndertook Technical Training for confidence building.\nDrafting Service Proposals for the OEM clients that are high value strategic opportunities.\nLed weekly calls to track progress on resource allocation on projects, ensuring customer satisfaction.\nMicrosoft Office, Customer Relationship Management (CRM) and +5 skills\nSales Associate\nSales Associate\nAug 2021 - Jul 2023 · 2 yrs\nAug 2021 to Jul 2023 · 2 yrs\nWarwickshire, England, United Kingdom\nWarwickshire, England, United Kingdom\nTechnical Quotation preparation activity, with commercials for Engineering Service.\nLiaising with Delivery and Talent Acquisition for suitable resources for various projects.\nMaintain a live tracker for Resource placement on projects, following standard AGILE practices and weekly reviews.\nLiaising with stakeholders on current project requirements and facilitate further discussions to build confidence.\nManage and maintain CRM Software (Salesforce) as an end user for a premium automotive client within the TATA Group.\nAlso assisted practice and delivery leads to set up accounts for smaller & mid-size businesses on the CRM platform.\nResource attribute change activity - to reassign resources under different managers/ projects.\nAutomotive Technology, Time Management and +5 skills",
      "company_name": "Full-time · 4 yrs 2 mos",
      "company_page_url": "https://www.linkedin.com/company/6369/"
    },
    {
      "lead_id": "ACoAAAUTfysBxnGJilELZ4rD5gspeE3ZRKOXemo",
      "name": "Vanessa Gentile",
      "title": "Salesforce\nSalesforce",
      "location": "Zurich, Zurich, Switzerland",
      "profile_url": "https://www.linkedin.com/in/ACoAAAUTfysBxnGJilELZ4rD5gspeE3ZRKOXemo",
      "bio": "Head of Marketing @Salesforce Switzerland | Golden Hoodie Awardee 2021 | Coaching & Psychology-Infused Leadership | Founder, Bring Women Back to Work NGO | Tech Diversity Advocate | Keynote Speaker | Podcast Host\nI'm half Brazilian and half Italian and mother of 2 sons. I grew up in the canton of Thurgau until I was 21, and then I moved to Zurich to pursue my career in the tech industry. I speak six languages fluently and am currently Head of Marketing at Salesforce in Switzerland, based in Zurich. With a deep understanding of market dynamics and consumer behaviour, I excel in developing and executing innovative marketing initiatives that generate brand awareness, drive customer engagement, and deliver measurable results. My leadership style is characterised by collaboration, empowerment, and a focus on fostering a high-performing marketing team. I inspire and motivate my team members to excel, encouraging creativity and innovation in developing compelling marketing tactics across various channels. I am inspired by the digital world and the full potential of digital transformation that can be achieved with DATA, AI, and CRM. Furthermore, I'm the founder of the non-profit organisation Bring Women Back to Work. Through my visionary leadership and unwavering dedication, I have successfully facilitated the re-entry of over 100 women into the workforce across Europe. My organisation focuses on empowering and supporting women who have taken career breaks, providing them opportunities to regain their professional momentum and contribute their valuable skills and expertise to the workforce. My personal mission is to foster gender equality and create pathways for women’s career advancement. Check this out for more information: www.bringwomenbacktowork.com\n…see more",
      "skills": [
        "Business-Coaching\nBusiness-Coaching",
        "Marketing\nMarketing"
      ],
      "experience": "Salesforce\nSalesforce\n7 yrs 2 mos\n7 yrs 2 mos\nHead of Marketing Switzerland\nHead of Marketing Switzerland\nFull-time\nFull-time\nMar 2022 - Present · 3 yrs 7 mos\nMar 2022 to Present · 3 yrs 7 mos\nSchweiz\nSchweiz\nThe Swiss Marketing team is guided by trust, collaboration, a culture of connection by working with our customers, partners and communities in Switzerland as one team. We inspire and empower each other to drive business success, innovation, equality and diversity . Our aim is to impact real change in pursuit of a more sustainable and equitable world to make the world a better place.\n+18\nDirector Alliance & Channel Switzerland\nDirector Alliance & Channel Switzerland\nFull-time\nFull-time\nFeb 2021 - Mar 2022 · 1 yr 2 mos\nFeb 2021 to Mar 2022 · 1 yr 2 mos\nZürich und Umgebung\nZürich und Umgebung\nIncrease our Partner Ecosystem and supporting companies moving in to the new normal.\nFocus on Capacity, Capability, Customer Success & Equality & Diversity as one of our core values.\nI believe in gender balanced teams by increase women in tech and supporting our partners and customers with new diverse talent resources.\nMy Vision is to scale companies DNA to move to a trust and inclusive enviroment which will bring Company profitability, customer success and employee satisfaction.\nInspire other companies to join #bwbw or build their own strategy to create more gender balanced workplace in the Tech Industry and increase the women % in Companies supported by the new Stock corporation law policy since 1.January 2021. The recipe? Iqual rights for all ❤\n+13\nAlliance & Channel Lead Switzerland & Founder of Bring women back to work program\nAlliance & Channel Lead Switzerland & Founder of Bring women back to work program\nFull-time\nFull-time\nFeb 2019 - Feb 2021 · 2 yrs 1 mo\nFeb 2019 to Feb 2021 · 2 yrs 1 mo\nZürich und Umgebung, Schweiz\nZürich und Umgebung, Schweiz\nMoving partners business forward as Partners world is undergoing a radical change to accommodate customers need in the 21st century. They are being impacting by the way we are changing and moving our technology forward and I'm very proud to support our Partner Eco-System in there transformational journey and furthermore support our Sales Organisation by empowering our partners scale our solution in to the Market.\nShow all 4 experiences",
      "company_name": "7 yrs 2 mos",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAABynfjEBQV9rwp9bz0e6z2hvXAznpH_2cKY",
      "name": "Michelle Cristina Bühler",
      "title": "Co-Founder\nCo-Founder",
      "location": "Lausanne Metropolitan Area",
      "profile_url": "https://www.linkedin.com/in/ACoAABynfjEBQV9rwp9bz0e6z2hvXAznpH_2cKY",
      "bio": "Head of Retail & Consumer Goods Marketing at Salesforce Switzerland",
      "skills": [
        "Digital Strategy\nDigital Strategy",
        "Entrepreneurship\nEntrepreneurship"
      ],
      "experience": "Co-Founder\nCo-Founder\nELEVATE Gym SA · Freelance\nELEVATE Gym SA · Freelance\nJan 2024 - Present · 1 yr 9 mos\nJan 2024 to Present · 1 yr 9 mos\nChavannes-près-Renens, Vaud, Switzerland · Hybrid\nChavannes-près-Renens, Vaud, Switzerland · Hybrid\nPro Bono Work - Providing strategic guidance to the team on overall business strategy, ensuring alignment with long-term goals. Developing and executing customer-centric marketing initiatives to attract and retain members. Fostering community engagement through tailored campaigns, events, and social media strategies, enhancing the gym’s connection with its audience.\nDigital Strategy, Marketing Strategy and +3 skills",
      "company_name": "ELEVATE Gym SA · Freelance",
      "company_page_url": "https://www.linkedin.com/company/101851489/"
    },
    {
      "lead_id": "ACoAAAnB4bUBn3aZxpTbOKdpYb1coRNUZ4pSqTs",
      "name": "Daiany Favarato",
      "title": "Diretora Comercial\nDiretora Comercial",
      "location": "Vitória, Espírito Santo, Brazil",
      "profile_url": "https://www.linkedin.com/in/ACoAAAnB4bUBn3aZxpTbOKdpYb1coRNUZ4pSqTs",
      "bio": "Country Manager at SkyPlanner",
      "skills": [
        "Inteligência artificial\nInteligência artificial",
        "ISO 14001\nISO 14001"
      ],
      "experience": "Diretora Comercial\nDiretora Comercial\nMultiset Tech · Full-time\nMultiset Tech · Full-time\nApr 2023 - Present · 2 yrs 6 mos\nApr 2023 to Present · 2 yrs 6 mos\nBrasil · Hybrid\nBrasil · Hybrid\nConsultoria e implementação de soluções Salesforce.\nConsultoria e implementação de soluções Salesforce.",
      "company_name": "Multiset Tech · Full-time",
      "company_page_url": "https://www.linkedin.com/company/33289971/"
    },
    {
      "lead_id": "ACoAADI5UeUB4PyKggUpheURcy4A_gN_LdegRFk",
      "name": "Sukhvir Singh Rangar",
      "title": "Software Engineer\nSoftware Engineer",
      "location": "Gurugram, Haryana, India",
      "profile_url": "https://www.linkedin.com/in/ACoAADI5UeUB4PyKggUpheURcy4A_gN_LdegRFk",
      "bio": "Software Engineer @EPAM | Ex-Salesforce | 9x Salesforce Certified | MCAE (Pardot), Sales Cloud & Data Cloud Consultant\nAs a Salesforce MCAE Consultant, I am involved in:\n\n1. Driving Client Calls with respect to any issue and new requirement and getting them delivered successfully and on time.\n2. Participating in project meetings, getting requirements from the business analyst, and delivering the project successfully.\n3. Setting up the Salesforce Connector in Pardot and mapping the custom fields of the salesforce.\n4. Designed workflows to support business processes and reporting requirements.\n5. Can troubleshoot and solve platform issues.\n6. Setting up and managing Pardot Campaigns\n7. Pardot Forms & Form Handlers, connection with websites to get the data directly into Pardot(Web to Lead).\n8. Lead Management.\n9. Scoring.\n10. Email Marketing, creation of the personalized email templates using PL and HML variables with the help of a web designer.\n11. Engagement Studio, setting up the emails to a journey as designed for the workflow.\n12. Landing Pages.\n13. Social Marketing, setting up the Facebook and google ads connector.\n14. Salesforce Integration using third-party applications like Zapier, Slack, etc.\n…see more",
      "skills": [
        "Data Integration\nData Integration",
        "IT Integration\nIT Integration"
      ],
      "experience": "Software Engineer\nSoftware Engineer\nEPAM Systems · Full-time\nEPAM Systems · Full-time\nApr 2025 - Present · 6 mos\nApr 2025 to Present · 6 mos\nGurugram, Haryana, India · Hybrid\nGurugram, Haryana, India · Hybrid",
      "company_name": "EPAM Systems · Full-time",
      "company_page_url": "https://www.linkedin.com/company/4972/"
    },
    {
      "lead_id": "ACoAACDDZ20BOn2l3RDA2Ns4dYxtZm2fRD7ojcE",
      "name": "Arnav Kumar Attri",
      "title": "LeadSquared\nLeadSquared",
      "location": "India",
      "profile_url": "https://www.linkedin.com/in/ACoAACDDZ20BOn2l3RDA2Ns4dYxtZm2fRD7ojcE",
      "bio": "Associate - Solutions Consultant @Leadsquared | Asanify | BITS PILANI '24",
      "skills": [
        "Data-driven Decision Making\nData-driven Decision Making",
        "Figma (Software)\nFigma (Software)"
      ],
      "experience": "LeadSquared\nLeadSquared\n1 yr 6 mos\n1 yr 6 mos\nNoida, Uttar Pradesh, India · On-site\nNoida, Uttar Pradesh, India · On-site\nAssociate - Solutions Consultant\nAssociate - Solutions Consultant\nFull-time\nFull-time\nAug 2024 - Present · 1 yr 2 mos\nAug 2024 to Present · 1 yr 2 mos\nData-driven Decision Making\nSolution Consultant \nSolution Consultant\nInternship\nInternship\nApr 2024 - Jul 2024 · 4 mos\nApr 2024 to Jul 2024 · 4 mos\nData-driven Decision Making",
      "company_name": "1 yr 6 mos",
      "company_page_url": "https://www.linkedin.com/company/2502171/"
    },
    {
      "lead_id": "ACoAACAyCaIB2dCAh3YBd6P0qnDa2UNOV38uBvw",
      "name": "Jessica Douglas",
      "title": "Dell Technologies\nDell Technologies",
      "location": "Dublin, County Dublin, Ireland",
      "profile_url": "https://www.linkedin.com/in/ACoAACAyCaIB2dCAh3YBd6P0qnDa2UNOV38uBvw",
      "bio": "Global Implementation Manager at Dell Technologies\nI am a Global Implementation Manager with a strong background in customer experience, process improvement, and project management. Proven expertise in training and mentoring teams across EMEA, with a focus on enhancing operational efficiency and customer satisfaction. Experienced in developing and delivering training programs, onboarding new team members, and creating centralized learning resources to support continuous development.\n\n🌍 EMEA Team Lead for the Premier Online Case Management Team at Dell Technologies, driving customer satisfaction and retention through strategic escalation management, global project support, and process optimization. I act as the primary point of contact for complex online queries, owning end-to-end case resolution and partnering across teams to deliver seamless digital experiences.\n\n👥 As team lead, I manage and mentor a high-performing team, overseeing day-to-day operations, conducting performance reviews, and supporting career development through regular goal check-ins and coaching. I foster a collaborative environment that encourages growth, accountability, and continuous improvement.\n\n💡 I lead training initiatives - including a ‘train the trainer’ model within our Office Hours program, to accelerate knowledge sharing and reduce escalations. I also deliver internal and customer-facing training sessions to support new feature rollouts and ensure smooth adoption.\n\n🚀 Collaborating with global project managers, product teams, and CSAT analysts, I help shape the online journey by identifying roadblocks, implementing improvements, and championing customer feedback. I am passionate about mentoring, stakeholder engagement, and driving scalable solutions that elevate the customer experience.\n…see more",
      "skills": [
        "Program Management\nProgram Management",
        "Training\nTraining"
      ],
      "experience": "Dell Technologies\nDell Technologies\n7 yrs 10 mos\n7 yrs 10 mos\nGlobal Implementation Manager | Sales Operations Advisor\nGlobal Implementation Manager | Sales Operations Advisor\nMay 2022 - Present · 3 yrs 5 mos\nMay 2022 to Present · 3 yrs 5 mos\nDublin, County Dublin, Ireland\nDublin, County Dublin, Ireland\nI am currently working as a Sales Operations Advisor for Dell Technologies for their online customer platform. \n\nI am a Global Implementation Manager with a strong background in customer experience, process improvement, and project management. Proven expertise in training and mentoring teams across EMEA, with a focus on enhancing operational efficiency and customer satisfaction. Experienced in developing and delivering training programs, onboarding new team members, and creating centralized learning resources to support continuous development.\n\nI lead the online experience workstream, managing escalations, supporting global project rollouts and driving process improvements to enhance customer satisfaction and retention.\n…see more\nCustomer Relationship Management (CRM), Customer Satisfaction and +8 skills\nE-Commerce Manager (Premier Account Manager) Sales Operations Senior Analyst\nE-Commerce Manager (Premier Account Manager) Sales Operations Senior Analyst\nDec 2019 - Aug 2022 · 2 yrs 9 mos\nDec 2019 to Aug 2022 · 2 yrs 9 mos\nE-Commerce Manager (Premier Account Manager) Sales Operations Analyst\nE-Commerce Manager (Premier Account Manager) Sales Operations Analyst\nDec 2017 - Dec 2019 · 2 yrs 1 mo\nDec 2017 to Dec 2019 · 2 yrs 1 mo",
      "company_name": "7 yrs 10 mos",
      "company_page_url": "https://www.linkedin.com/company/15088102/"
    },
    {
      "lead_id": "ACoAAAgbAB8BuPel_WFjmMSQW5lBSwW12k0cnmk",
      "name": "Manuela Andrade",
      "title": "Salesforce\nSalesforce",
      "location": "São Paulo, São Paulo, Brazil",
      "profile_url": "https://www.linkedin.com/in/ACoAAAgbAB8BuPel_WFjmMSQW5lBSwW12k0cnmk",
      "bio": "Regional Sales Manager Leader\nI am a passionate professional focused on innovation and driven to results. Strong communication, interpersonal and analytical skills have resulted in the success of professional activities in Brazil, and as an academic student in United States and Spain.\nI am a passionate professional focused on innovation and driven to results. Strong communication, interpersonal and analytical skills have resulted in the success of professional activities in Brazil, and as an academic student in United States and Spain.",
      "skills": [
        "Management\nManagement",
        "Salesforce.com\nSalesforce.com"
      ],
      "experience": "Salesforce\nSalesforce\nFull-time · 3 yrs\nFull-time · 3 yrs\nSr Regional Sales Manager\nSr Regional Sales Manager\nJun 2025 - Present · 4 mos\nJun 2025 to Present · 4 mos\nSão Paulo, São Paulo, Brazil · On-site\nSão Paulo, São Paulo, Brazil · On-site\nRegional Sales Manager\nRegional Sales Manager\nMay 2024 - Jun 2025 · 1 yr 2 mos\nMay 2024 to Jun 2025 · 1 yr 2 mos\nSão Paulo, Brazil\nSão Paulo, Brazil\n- Delivered a result of 56% Y/Y e 23% 2YR CAGR on FY25.\n-Started FY26 with 37% of result on the fourth month of the year.\n- Promoted 90% of the AE;s to new roles inside Salesforce\nManuela Andrade, Author at Salesforce\nManuela Andrade, Author at Salesforce\nSignature Sales Blog at Salesforce \nSignature Sales Blog at Salesforce\nSales Development Manager\nSales Development Manager\nOct 2022 - May 2024 · 1 yr 8 mos\nOct 2022 to May 2024 · 1 yr 8 mos\nSão Paulo, Brazil\nSão Paulo, Brazil\nResponsible for growing, developing, and managing a team of Sales Development Representatives (SDR). Other responsibilities include driving market share and qualifying leads that build pipeline for the sales organization.",
      "company_name": "Full-time · 3 yrs",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAAfY-g8BvDQi5gz_Rv5FL7V422hfw2zWdDI",
      "name": "Frida Horbino",
      "title": "Senior Field Marketing Manager\nSenior Field Marketing Manager",
      "location": "Greater Sydney Area",
      "profile_url": "https://www.linkedin.com/in/ACoAAAfY-g8BvDQi5gz_Rv5FL7V422hfw2zWdDI",
      "bio": "Senior Field Marketing Manager, Australia & NZ Regional Lead\nDynamic marketing leader with extensive experience in driving strategic marketing initiatives across Australia and New Zealand. Proven expertise in stakeholder management, leading high-impact projects, and spearheading executive programs that align with business goals. Adept at building and nurturing relationships with key stakeholders, delivering tailored marketing strategies, and leading cross-functional teams to execute regional marketing campaigns. Passionate about creating value-driven programs that enhance customer engagement and drive business growth.\n\nSpecialties: Field Marketing, Executive Progtams, Digital Marketing, Channel Marketing, Marketing Campaigns, Social Media, Strategic Planning (Marketing & PR), Internal and External Communications, Email Marketing, Web Content Creation and Management\n…see more",
      "skills": [
        "Press Releases\nPress Releases",
        "Public Relations\nPublic Relations"
      ],
      "experience": "Senior Field Marketing Manager\nSenior Field Marketing Manager\nSalesforce · Full-time\nSalesforce · Full-time\nJun 2022 - Present · 3 yrs 4 mos\nJun 2022 to Present · 3 yrs 4 mos\nSydney, New South Wales, Australia\nSydney, New South Wales, Australia",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAAAUqXMBIX4qPp8tN4C5yOKcGpNPgv-OfHU",
      "name": "Ivette Johnson ☁️",
      "title": "Salesforce Account Director, Retail & Consumer Goods\nSalesforce Account Director, Retail & Consumer Goods",
      "location": "Branford, Connecticut, United States",
      "profile_url": "https://www.linkedin.com/in/ACoAAAAUqXMBIX4qPp8tN4C5yOKcGpNPgv-OfHU",
      "bio": "Salesforce Account Director, Retail & Consumer Goods\nMore than 20 years experience in Brand Management and Marketing Strategy developing consumer and retail brands via Marketing Strategy and Digital Marketing. More recently Account Director for Retail and Consumer Goods vertical at Salesforce. International experience in USA, Europe, and Latin America. Leadership and coaching of multi-functional teams and developing people and talent.\n…see more",
      "skills": [
        "Digital Marketing\nDigital Marketing",
        "Market Planning\nMarket Planning"
      ],
      "experience": "Salesforce Account Director, Retail & Consumer Goods\nSalesforce Account Director, Retail & Consumer Goods\nSalesforce · Full-time\nSalesforce · Full-time\nFeb 2021 - Present · 4 yrs 8 mos\nFeb 2021 to Present · 4 yrs 8 mos\nBranford, Connecticut, United States\nBranford, Connecticut, United States\nRetail and Consumer Goods\nRetail and Consumer Goods\nSalesforce.com: The Customer Success Platform To Grow Your Business\nSalesforce.com: The Customer Success Platform To Grow Your Business\nPersonalize every experience along the customer journey with the Customer 360. Unify marketing, sales, service, commerce, and IT on the world's #1 CRM.",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAAaDvC8BCPAsbMIyEf6dCiTU57_-KH8gKtI",
      "name": "Ale Fu 傅爱莉",
      "title": "Director Enterprise Architecture\nDirector Enterprise Architecture",
      "location": "São Paulo, São Paulo, Brazil",
      "profile_url": "https://www.linkedin.com/in/ACoAAAaDvC8BCPAsbMIyEf6dCiTU57_-KH8gKtI",
      "bio": "Director Enterprise Architect @ Salesforce | Non Executive Director & Committee Member | AI & Cloud\nSenior Director and Strategic Leader with over 18 years of experience in leadership positions within technology companies, Media & Entertainment, Telecom, Manufacture, start-ups, and the CPG industry. With a robust background in enterprise architecture, digital transformation, business strategy, partnership development, sales, and customer engagement, consistently demonstrated ability to drive business growth and foster innovation. Extensive experience includes managing multi-million-dollar projects, leading large teams, and developing long-term strategic plans that align with organizational goals. Build and maintain key customer and stakeholder relationships, overseeing budget management and resource allocation, and ensuring operational excellence through process improvement and performance metrics. With a deep understanding of LATAM markets and adept at navigating complex challenges and delivering impactful results.\n\nAs the Principal Enterprise Architect at Salesforce, my mission is to guide C-Level executives towards cloud-powered business transformation, underpinned by a strong foundation in business innovation and analytical skills. Our team's efforts in the Retail and CPG sectors, evidenced by solutions like Commerce Cloud and CRM, reflect our commitment to delivering impactful industry-specific strategies.\n\nIn parallel, serving as Vice-Coordinator at IBGC sharpens my expertise in corporate governance and strategic oversight. I leverage change management and project management strengths to drive initiatives that foster a culture of diversity, equity, and inclusion. My approach combines industry experience with strategic innovation, aiming to break traditional barriers and inspire transformation through education and example.\n…see more",
      "skills": [
        "Business Development · Public Policy · Public Relations · Business Intelligence · Negotiation · New Business Development · Strategic Partnerships\nBusiness Development · Public Policy · Public Relations · Business Intelligence · Negotiation · New Business Development · Strategic Partnerships",
        "Estratégia digital\nEstratégia digital"
      ],
      "experience": "Director Enterprise Architecture\nDirector Enterprise Architecture\nSalesforce · Full-time\nSalesforce · Full-time\nJan 2022 - Present · 3 yrs 9 mos\nJan 2022 to Present · 3 yrs 9 mos\nBrazil\nBrazil\nAdvise Salesforce customer C-Level and Business Architects on how to power their business on cloud-based architectures leveraging multiple technologies. Provide guidance based on business goals and organization needs, integrating people, process, and technology into a cohesive strategic vision using product knowledge, industry experience, industry-standard EA frameworks, and Salesforce EA methodologies.\n\nIn this role, a strong focus is placed on **discipline** in execution, maintaining a structured and methodical approach to complex challenges. **Performance and delivery** are paramount, ensuring that all engagements drive measurable outcomes aligned with the customer's objectives.\n\nThe role emphasizes a **result-driven pipeline**, leveraging data insights to prioritize opportunities and direct efforts where they will create the greatest impact. Through **data-driven decision-making**, the role ensures alignment with forecast and revenue targets, while maintaining a strategic and structured perspective to scale solutions effectively.\n\nA commitment to **application rigor** is essential, ensuring that recommended solutions are not only innovative but also robust and sustainable. The role focuses on **consumption and impact**, ensuring that solutions are adopted and deliver tangible business outcomes.\n\nKey responsibilities include managing **forecast and revenue** expectations with precision, driving clear alignment between customer objectives and Salesforce's solutions. The role is **structural and foundational**, providing frameworks and approaches that enable sustainable growth and innovation within customer organizations.\n\nThis position demands a combination of visionary strategy and operational excellence, working as a trusted advisor to drive transformation and deliver meaningful results.\nNegotiation, Leadership and +18 skills",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAACenznoBj5kzyPe0kktj9V8sBtMVtR-SCuU",
      "name": "Twinkle Monga",
      "title": "Accenture\nAccenture",
      "location": "Gurugram, Haryana, India",
      "profile_url": "https://www.linkedin.com/in/ACoAACenznoBj5kzyPe0kktj9V8sBtMVtR-SCuU",
      "bio": "Senior Salesforce Developer @Accenture | Ex - Coding Educator Consultant @Vedantu | PM Fellow @NextLeap\nCurrently working in Accenture as Senior Salesforce Analyst. I have 4 years of experience working in Salesforce. \nBelieve in creating individual worth and adding value to an organization. Ready to experiment and learn from failures.\nCurrently working in Accenture as Senior Salesforce Analyst. I have 4 years of experience working in Salesforce. Believe in creating individual worth and adding value to an organization. Ready to experiment and learn from failures.",
      "skills": [
        "Bitbucket\nBitbucket",
        "Salesforce.com Development\nSalesforce.com Development"
      ],
      "experience": "Accenture\nAccenture\nFull-time · 4 yrs 3 mos\nFull-time · 4 yrs 3 mos\nApplication Development Senior Analyst\nApplication Development Senior Analyst\nJun 2025 - Present · 4 mos\nJun 2025 to Present · 4 mos\nGurugram\nGurugram\nAtlassian, Salesforce Lightning and +4 skills\nApplication Development Analyst\nApplication Development Analyst\nJul 2021 - May 2025 · 3 yrs 11 mos\nJul 2021 to May 2025 · 3 yrs 11 mos\nGurugram, Haryana, India\nGurugram, Haryana, India\nSalesforce, Atlassian and +1 skill",
      "company_name": "Full-time · 4 yrs 3 mos",
      "company_page_url": "https://www.linkedin.com/company/1033/"
    },
    {
      "lead_id": "ACoAABbgVR0B2DMHS3wPXMTKgLiJLCmY4WbYNv0",
      "name": "Aditi Rakhe",
      "title": "Senior Technical Consultant - Salesforce Developer \nSenior Technical Consultant - Salesforce Developer",
      "location": "Pune, Maharashtra, India",
      "profile_url": "https://www.linkedin.com/in/ACoAABbgVR0B2DMHS3wPXMTKgLiJLCmY4WbYNv0",
      "bio": "Senior Technical Consultant at Salesforce 🌩️ || 14x Salesforce Certified || All⭐ Ranger ⚡|| 18x Super Badges || topmate.io/aditi_rakhe\nTechnology Enthusiast, aspiring to bring the best outcome by applying my skills as per the business requirements.\n\nSalesforce Developer carrying knowledge in various tools and technologies such as \n*Security Model\n*Page Layouts,Compact Layouts and Report Types\n*Lightning framework (Aura and LWC)\n*Apex - Synchronous and Asynchronous & sflib and fflib pattern\n*Triggers\n*Visualforce\n*AJAX\n*Big Objects\n*Einstein - Case Classification\n*Lightning Flows - Screen Flows, Autolaunch Flows and Trigger flows\n*Process Builder\n*Custom and Metadata Settings/Label\n*Salesforce Configurations\n* Salesforce Integration with Rest and Soap API\n*External Objects,Connected App configuration\nIntegration with Salesforce and Marketing Cloud\nIntegration with Salesforce and WhatsApp\nIntegration with Salesforce and Slack\nIntegration Salesforce with Open API\nIntegration Salesforce with Billing System\n*Service Cloud Implementation\n**B2C commerce Cloud - Basics\nExperience Cloud - Intermediary Knowledge\n***Finance Cloud\n\nCloud Technologies which i have been Practicing: Salesforce - Service/Sales Cloud/Marketing Cloud\n\nPostman , SoapUI\nDatabase handling capabilities :\nSOSL and SOQL\n\nWeb technologies : Visualforce,HTML,CSS,Javascript, Aura and LWC.\n\nMonitoring Tools:\nReports and Dashboards in Salesforce.\n\nDeployment Tools:\nChange sets, ANT, Salesforce Package, Force.com IDE,GIT , Bitbucket and Jenkins\n\nR Programming, R studio , Data Mining ,\nIOT ,Machine Learning\n\n“If any of the above sounds interesting and you think it would be a potential fit to work together, send me an invitation to connect and let’s talk!”\n…see more",
      "skills": [
        "Networking\nNetworking",
        "Problem Solving\nProblem Solving"
      ],
      "experience": "Senior Technical Consultant - Salesforce Developer \nSenior Technical Consultant - Salesforce Developer\nSalesforce · Full-time\nSalesforce · Full-time\nApr 2024 - Present · 1 yr 6 mos\nApr 2024 to Present · 1 yr 6 mos\nPune, Maharashtra, India\nPune, Maharashtra, India",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAADIJMRMBtPvLow4OVkhmsJJQ22x3qmyh9Jw",
      "name": "Daniel Carmona",
      "title": "Técnico Customer Intelligence\nTécnico Customer Intelligence",
      "location": "Madrid, Community of Madrid, Spain",
      "profile_url": "https://www.linkedin.com/in/ACoAADIJMRMBtPvLow4OVkhmsJJQ22x3qmyh9Jw",
      "bio": "Marketing Automation Consultant | Salesforce Marketing Cloud | Marketing Digital | Análisis de datos | Customer Experience |\n👋 ¡Hola! Soy Daniel Carmona Martínez, un apasionado del marketing digital, siempre en la búsqueda de nuevas oportunidades para crecer y aprender. Acabo de terminar de cursar un máster en Marketing Digital en la Universidad Complutense de Madrid y estoy buscando comenzar mi trayectoria en el mundo laboral. Mi enfoque principal radica en aplicar los principios sociológicos al ámbito digital, lo que me permite identificar oportunidades emergentes a partir de fenómenos sociales y transformarlas en estrategias efectivas.\n\n💡 Tengo un perfil funcional y analítico, con alta experiencia en herramientas del Marketing digital como Google Analytics, creación de páginas web, diseños web, optimización de conversiones (CRO), SEO, CRM, gestión de RRSS etc. He tenido la oportunidad de participar en proyectos clave como la optimización SEO de la tienda online de Joan Pradells y la creación de una estrategia integral de marketing para La Villana, maximizando su visibilidad y alcance digital.(https://vm.tiktok.com/ZGeE7hAc1/)\n\n📊 Soy una persona curiosa y polifacética, por ello comencé a formarme también en herramientas específicas del análisis de datos como Python, Rstudio, SPSS y Excel, en la cual tengo un nivel alto de manejo. Me encanta explorar nuevos campos y estoy siempre abierto a asumir nuevos retos que me permitan expandir mis horizontes y conocimientos.\n\n✅Además de mi perfil analítico y estratégico, cuento con grandes capacidades para moverme y adaptarme en distintos contextos sociales gracias a haber trabajado en varios servicios de cara al público como el SAMUR SOCIAL.\n\n🎯 Mi objetivo es seguir creciendo a nivel profesional y sobre todo en el Marketing digital, aplicando mis habilidades y conocimientos para ayudar a empresas a destacar en el entorno digital. Pero siempre estaré abierto a descubrir nuevas experiencias profesionales más allá del Marketing. Si buscas a alguien con pasión por la tecnología, la estrategia digital y el análisis de tendencias sociales, ¡hablemos!\n…see more",
      "skills": [
        "Comunicación\nComunicación",
        "Gestión de relaciones con clientes (CRM)\nGestión de relaciones con clientes (CRM)"
      ],
      "experience": "Técnico Customer Intelligence\nTécnico Customer Intelligence\nTENDAM · Full-time\nTENDAM · Full-time\nApr 2025 - Present · 6 mos\nApr 2025 to Present · 6 mos\nMadrid, Comunidad de Madrid, España · Hybrid\nMadrid, Comunidad de Madrid, España · Hybrid\n helped me get this job\nLinkedIn helped me get this job\n• Programación y ejecución de campañas automatizadas en Salesforce Marketing Cloud para las distintas marcas del grupo (Springfield, Cortefiel, Pedro del Hierro, Women’secret, Hoss Intropia, etc.) en varios países.\n• Diseño y mantenimiento de journeys de cliente y automatizaciones mediante Journey Builder y Automation Studio.\n• Optimización continua de los procesos automatizados, aprovechando las funcionalidades avanzadas de Salesforce.\n• Seguimiento de campañas, análisis de rendimiento y elaboración de informes para la toma de decisiones basada en datos.\n• Colaboración estrecha con equipos de marca y áreas transversales para alinear la estrategia de CRM con los objetivos comerciales.\n01_tendam_logo.jpg\n01_tendam_logo.jpg",
      "company_name": "TENDAM · Full-time",
      "company_page_url": "https://www.linkedin.com/company/28641217/"
    },
    {
      "lead_id": "ACoAAA7-fIEBn7Uo-5usvxIXFQP0DomVlSHgvuM",
      "name": "Ramsés José Granado",
      "title": "Promotor\nPromotor",
      "location": "Spain",
      "profile_url": "https://www.linkedin.com/in/ACoAAA7-fIEBn7Uo-5usvxIXFQP0DomVlSHgvuM",
      "bio": "Project Manager CRM & Salesforce | Analista de Sistemas | Experto en Implementaciones End-to-End\nProject Manager CRM y Consultor Salesforce con más de 12 años de experiencia en tecnología y 7 años especializado en implementaciones de Salesforce (Sales, Service, Marketing Cloud, Financial y Education). Mi trayectoria incluye el liderazgo de proyectos de transformación digital end-to-end, desde la toma de requerimientos hasta la adopción exitosa por parte del usuario. \n\nMi fortaleza radica en la integración de equipos, la documentación de procesos y la creación de soluciones funcionales que generan un impacto real en el negocio. He trabajado en implementaciones complejas, automatización de procesos con Power Automate y análisis de datos con Power BI.\n\nHoy más que nunca busco una oportunidad para seguir creciendo y aportar mi experiencia, energía y compromiso en un nuevo rol de Analista de Sistemas, Project Manager o Gestor de Implementaciones.\n\nFluent in English - Available for global projects.\n…see more",
      "skills": [
        "IA\nIA",
        "Gestión de relaciones con clientes (CRM)\nGestión de relaciones con clientes (CRM)"
      ],
      "experience": "Promotor\nPromotor\nSALESLAND · Part-time\nSALESLAND · Part-time\nJul 2025 - Present · 3 mos\nJul 2025 to Present · 3 mos\nMadrid, Comunidad de Madrid, España · On-site\nMadrid, Comunidad de Madrid, España · On-site\nPromotor comercial responsable de la captación de nuevos clientes para productos financieros (tarjetas Carrefour PASS) en tienda.\n- Atención al cliente y explicación de beneficios de forma clara y empática.\n- Registro de solicitudes y coordinación con el equipo de servicios financieros.\n- Enfoque en objetivos de ventas diarias y cumplimiento de métricas de calidad.",
      "company_name": "SALESLAND · Part-time",
      "company_page_url": "https://www.linkedin.com/company/1569584/"
    },
    {
      "lead_id": "ACoAAAqha_UBknwgTKajYtJPVfwPVK2GLCuLLCE",
      "name": "Snehasri Dutta",
      "title": "Accenture UK & Ireland\nAccenture UK & Ireland",
      "location": "London, England, United Kingdom",
      "profile_url": "https://www.linkedin.com/in/ACoAAAqha_UBknwgTKajYtJPVfwPVK2GLCuLLCE",
      "bio": "31x Salesforce Certified | Salesforce Technical Architect | Technology Architecture Manager at Accenture UK & Ireland\n31x Salesforce Certified System Architect & Application Architect, working with Salesforce and its associated technologies for over 11 years; designing and implementing complex Salesforce solutions involving configuration, customization, integration and more, for businesses associated with Technology, Banking & Financial Services, Telecom, Healthcare and FMCG domains in UKI, EMEA, APAC and NA.\n\nSalesforce Trailhead Triple Star Ranger with a profound interest in latest and evolving Salesforce technologies, capabilities, platform updates, services and applications.\n\nTech Architecture Manager at Accenture UK & Ireland since 2019. Worked at Cognizant and Virtusa previously, towards design, development and delivery of challenging implementations for Salesforce customers.\n…see more",
      "skills": [
        "Salesforce.com\nSalesforce.com",
        "Salesforce.com Development\nSalesforce.com Development"
      ],
      "experience": "Accenture UK & Ireland\nAccenture UK & Ireland\nFull-time · 6 yrs 7 mos\nFull-time · 6 yrs 7 mos\nLondon, England, United Kingdom\nLondon, England, United Kingdom\nTech Architecture Manager\nTech Architecture Manager\nDec 2023 - Present · 1 yr 10 mos\nDec 2023 to Present · 1 yr 10 mos\nDesign and deliver the technology architecture for a platform, product, or engagement, from development to operations. Shape technology architecture during the sales and solutioning process, as required.\nTech Architecture Associate Manager\nTech Architecture Associate Manager\nDec 2020 - Nov 2023 · 3 yrs\nDec 2020 to Nov 2023 · 3 yrs\nDesigning and delivering the technology architecture for a platform, product, or engagement, from development to operations. \nShaping technology architecture during the sales and solutioning process, as required.\nSought out as an expert of deep functional industry expertise and domain knowledge.\nBusiness & Integration Arch Specialist\nBusiness & Integration Arch Specialist\nMar 2019 - Nov 2020 · 1 yr 9 mos\nMar 2019 to Nov 2020 · 1 yr 9 mos\nUse expertise to develop/support operable and cost effective solutions, review solution blueprints, estimates, conceptual designs, and/or other deliverables\nActively contribute to Accenture assets/offerings, points of view, Knowledge Exchange, discussion boards, etc.\nParticipate in external organizations related to functional, technical or industry area of expertise in order to enhance Accenture's brand recognition\nParticipate in projects/programs focused on delivering agreed business outcomes for clients\nProvide/implement the strategy to understand and translate business requirements into technology solutions\nIncorporate Industry, Function, and/or Business expertise into recommended solutions\nEnsure technology business changes represent business requirements\nDevelop and implement the best business solutions for the client\nLead programs/projects focused on delivering agreed business outcomes for clients\nPartner with clients to understand the dynamic of value creation for the business solution\nAnalyze as-is and to-be processes to define system/technology requirements and bridge the gap between technology and the business\nDeliver quality functional/application designs and ensure technology business changes represent business requirements",
      "company_name": "Full-time · 6 yrs 7 mos",
      "company_page_url": "https://www.linkedin.com/company/3733171/"
    },
    {
      "lead_id": "ACoAAAASQjEBKY_k-FulPvelqoofbdkLnF6IPHk",
      "name": "Marcelo Konatu",
      "title": "Salesforce\nSalesforce",
      "location": "São Paulo, Brazil",
      "profile_url": "https://www.linkedin.com/in/ACoAAAASQjEBKY_k-FulPvelqoofbdkLnF6IPHk",
      "bio": "Regional Vice President, Success Management at Salesforce\nA capable leader with vast experience in customer success, project management and enterprise customer experience. Extensive experience in leading high performance teams to deliver exceptional enterprise services for Fortune 500 companies with proven track in the areas of customer success and account management, knowledge management and customer satisfaction.\n\nProven project management skills through successful implementation of complex global projects involving cross-functional and international teams. Excellent communication skills coupled with ability to managed expectations and work effectively with teams at operational level to C-level executives.\n\nSolid experience working with high profile customers in the Latin America region. Bi-lingual: Full command of English and Portuguese. Dual citizenship: Brazilian and American.\n…see more",
      "skills": [
        "Cloud Computing\nCloud Computing",
        "Salesforce.com\nSalesforce.com"
      ],
      "experience": "Salesforce\nSalesforce\nFull-time · 11 yrs 4 mos\nFull-time · 11 yrs 4 mos\nSão Paulo, Brazil\nSão Paulo, Brazil\nRegional Vice President, Success Management\nRegional Vice President, Success Management\nFeb 2022 - Present · 3 yrs 8 mos\nFeb 2022 to Present · 3 yrs 8 mos\nSuccess Manager Director\nSuccess Manager Director\nFeb 2018 - Feb 2022 · 4 yrs 1 mo\nFeb 2018 to Feb 2022 · 4 yrs 1 mo\nSenior Principal Success Manager\nSenior Principal Success Manager\nJun 2014 - Feb 2018 · 3 yrs 9 mos\nJun 2014 to Feb 2018 · 3 yrs 9 mos\nSuccess Manager working with the largest Salesforce customers, with focus in the financial services, manufacturing and services verticals. Responsible for driving successful adoption of Salesforce solutions and increasing their value and expand the Salesforce product portfolio with key quantitative and qualitative metrics with detailed account planning.\n\nResponsible for driving programs “at scale” to implement, expand and deploy Salesforce solutions via training, community management and foster user group activities for customers in Brazil. Key contributor to launch, localize and deploy Salesforce corporate programs to the Latin America region.",
      "company_name": "Full-time · 11 yrs 4 mos",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAAmKxAkB0ArWsGQ4jLWOIL7QDO7-zJG42II",
      "name": "Leonard Pérez Santana",
      "title": "Banco Confisa\nBanco Confisa",
      "location": "Santo Domingo Norte, Santo Domingo, Dominican Republic",
      "profile_url": "https://www.linkedin.com/in/ACoAAAmKxAkB0ArWsGQ4jLWOIL7QDO7-zJG42II",
      "bio": "Confisa's Bank IT Manager, IT Director, Developer Manager, IT Project Manager\nProfessional highly experienced in administration and leadership of software development projects and teams of technologists, dedicated, capable, honest, integral and persistent.\nProfessional highly experienced in administration and leadership of software development projects and teams of technologists, dedicated, capable, honest, integral and persistent.",
      "skills": [
        "Project Management Office (PMO)\nProject Management Office (PMO)",
        "Negotiation\nNegotiation"
      ],
      "experience": "Banco Confisa\nBanco Confisa\nBanco Confisa\n11 yrs 11 mos\n11 yrs 11 mos\nIT Manager\nIT Manager\nJun 2018 - Present · 7 yrs 4 mos\nJun 2018 to Present · 7 yrs 4 mos\nPlan, organize and direct operations and projects in the area of information technology, through the development and implementation of modern technology, aligned with the strategy of the entity; to streamline the processes of the areas and meet optimal service levels, with the aim of providing quick and assertive solutions, in order to achieve the goals organizations.\n…see more\nSQL, Data Analysis and +10 skills\nSoftware Developer Manager\nSoftware Developer Manager\nNov 2013 - Present · 11 yrs 11 mos\nNov 2013 to Present · 11 yrs 11 mos\nDominican Republic\nDominican Republic\nManage the area, human resources and equipment for software development.\nLead new software development projects.\nDesign new applications\nDevise solutions tailored to the company.\nLead and collaborate with new implementations.\nDesign business intelligence solutions.\nDesign integrations between systems.\nDevelop strategies for maintenance and updating or replacement of. existing software platforms.\nDevise and propose to improve internal and external systems.\nLead projects related to software executed by third parties.\n…see more\nSQL, Project Delivery and +5 skills",
      "company_name": "11 yrs 11 mos",
      "company_page_url": "https://www.linkedin.com/search/results/all/?keywords=Banco+Confisa"
    },
    {
      "lead_id": "ACoAAAPSUhsBmNAxFsCaWpRaSIbj0R4yjYH9Qew",
      "name": "Abhishek Chatterji",
      "title": "Deloitte India (Offices of the US)\nDeloitte India (Offices of the US)",
      "location": "Bengaluru, Karnataka, India",
      "profile_url": "https://www.linkedin.com/in/ACoAAAPSUhsBmNAxFsCaWpRaSIbj0R4yjYH9Qew",
      "bio": "Manager at Deloitte Consulting || Enabling Delivery Excellence through GenAI Solutions || Salesforce FSI || Insurance Industry Focused\nWith over 14 years of experience in CRM, I specialize in delivering comprehensive Salesforce solutions, particularly within the financial services and insurance sectors. My career has spanned various domains, including Financial Services and Automotive, where I have successfully managed and executed complex CRM projects across multiple geographies and systems.\n\nProfessional Summary:\n-Seasoned Manager: Proven leadership in guiding teams through all stages of project development, from analysis and requirement gathering to design, development, enhancements, testing, deployment, and maintenance of cloud-based Salesforce applications.\n-Salesforce Expertise: Extensive experience in Salesforce Administration, Configuration, Implementation, and Support. Proficient in leveraging Salesforce Integration best practices to deliver robust solutions.\nInsurance Domain Focus: Specialized in crafting tailored Salesforce solutions for financial clients, with a strong emphasis on the insurance industry.\n-Agile Practices: Expertise in implementing agile methodologies to enhance project efficiency and team collaboration. Skilled in leading agile transformations and fostering a culture of continuous improvement.\n-Strategic Leadership: Adept at handling RFPs, Estimation, Staffing and Ramp Plans, and Solution Architecture, ensuring alignment with business objectives and client needs.\nInnovative Solutions: Experienced in utilizing Salesforce Einstein Analytics, including Dashboards, Vision, Intent, and Sentiment APIs, to drive data-driven decision-making and enhance customer insights.\n-GenAI Advocate: Passionate about Generative AI (GenAI) and actively working within the firm to improve the adoption and learning of GenAI tools. Committed to upskilling employees and integrating advanced AI capabilities to drive innovation and efficiency.\n\nKey Skills:\n-Leadership and Team Management\n-Salesforce CRM Solutions\n-Financial Services and Insurance Expertise\n-Agile Methodologies and Practices\n-Strategic Planning and Execution\n-Client Relationship Management\n-Data-Driven Insights and Analytics\n-Generative AI (GenAI) Advocacy and Training\n\nI am passionate about leveraging my deep Salesforce knowledge and Insurance industry expertise to drive business transformation and deliver exceptional value to clients, while also championing the integration of cutting-edge GenAI tools to foster innovation and continuous improvement.\n…see more",
      "skills": [
        "Data Integration\nData Integration",
        "Generative AI\nGenerative AI"
      ],
      "experience": "Deloitte India (Offices of the US)\nDeloitte India (Offices of the US)\n9 yrs 11 mos\n9 yrs 11 mos\nSalesforce Technical Manager\nSalesforce Technical Manager\nFull-time\nFull-time\nMay 2021 - Present · 4 yrs 5 mos\nMay 2021 to Present · 4 yrs 5 mos\nBengaluru, Karnataka, India\nBengaluru, Karnataka, India\nProduct Demonstration, Communication and +5 skills\nSenior Consultant\nSenior Consultant\nSep 2017 - May 2021 · 3 yrs 9 mos\nSep 2017 to May 2021 · 3 yrs 9 mos\nBengaluru Area, India\nBengaluru Area, India\nProduct Demonstration, Communication and +5 skills\nConsultant\nConsultant\nNov 2015 - Sep 2017 · 1 yr 11 mos\nNov 2015 to Sep 2017 · 1 yr 11 mos\nBengaluru Area, India\nBengaluru Area, India\nProduct Demonstration, Communication and +3 skills",
      "company_name": "9 yrs 11 mos",
      "company_page_url": "https://www.linkedin.com/company/1038/"
    },
    {
      "lead_id": "ACoAACX9l-wB4doPsbhL2gJdhzjmiTFVHw1bfOo",
      "name": "Saikat Ghosh",
      "title": "Technical Consultant\nTechnical Consultant",
      "location": "Kolkata, West Bengal, India",
      "profile_url": "https://www.linkedin.com/in/ACoAACX9l-wB4doPsbhL2gJdhzjmiTFVHw1bfOo",
      "bio": "Technical Consultant at Salesforce || Salesforce Developer || 5 YOE || 9X Salesforce Certified || 1X Copado Certified || All Star Ranger || Agentforce Legend || LWC || Apex || Integration || Flows || Platform Events ||\nI am a Salesforce Developer with 4+ years of experience and currently worked in Salesforce. I am a certified professional committed to staying current with Salesforce innovations. My expertise lies in Apex, Lightning, system integration, and various Salesforce functionalities such as data migration, reports, dashboards, and security. He has successfully managed Salesforce release management activities and integrated external systems through REST API. With a strong background in technical skills and soft skills like adaptability, effective communication, and problem-solving, I have proven to be a valuable asset in delivering customized solutions and collaborating with teams. I hold multiple Salesforce certifications, including Certified Administrator, Platform Developer, Sales Cloud Consultant, and Platform App Builder. I have done B.Tech degree in Electrical Engineering from St. Thomas' College of Engineering and Technology.\n…see more",
      "skills": [
        "OmniStudio Developement\nOmniStudio Developement",
        "Salesforce.com Development\nSalesforce.com Development"
      ],
      "experience": "Technical Consultant\nTechnical Consultant\nSalesforce · Full-time\nSalesforce · Full-time\nJul 2024 - Present · 1 yr 3 mos\nJul 2024 to Present · 1 yr 3 mos\nBangalore · Hybrid\nBangalore · Hybrid",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAACx-oawBDE4s0PINE_A7f0tenrSxvpZwfEo",
      "name": "Muru D",
      "title": "Regional Manager - Customer Support\nRegional Manager - Customer Support",
      "location": "Bengaluru South, Karnataka, India",
      "profile_url": "https://www.linkedin.com/in/ACoAACx-oawBDE4s0PINE_A7f0tenrSxvpZwfEo",
      "bio": "Regional Manager - Customer Support at ServiceMax\nRegional Manager - Customer Support\nRegional Manager - Customer Support",
      "skills": [
        "Project Management\nProject Management",
        "Scrum\nScrum"
      ],
      "experience": "Regional Manager - Customer Support\nRegional Manager - Customer Support\nServiceMax · Full-time\nServiceMax · Full-time\nAug 2020 - Present · 5 yrs 2 mos\nAug 2020 to Present · 5 yrs 2 mos\nBengaluru, Karnataka, India\nBengaluru, Karnataka, India",
      "company_name": "ServiceMax · Full-time",
      "company_page_url": "https://www.linkedin.com/company/528338/"
    },
    {
      "lead_id": "ACoAAANEmH4BeuF6vodJeGYW3Np8peF_hHsr54A",
      "name": "Sachin Sharma",
      "title": "General Manager\nGeneral Manager",
      "location": "Mumbai, Maharashtra, India",
      "profile_url": "https://www.linkedin.com/in/ACoAAANEmH4BeuF6vodJeGYW3Np8peF_hHsr54A",
      "bio": "Digital Strategy and Business Transformation, Head -Global IT Applications\nVisionary IT Leader with Global Impact with over 16 years of extensive experience in IT Management and Proven track record in spearheading transformative projects across diverse geographies, driving digital enablement, and modernizing IT landscapes.\n\nSpearheaded IT modernization initiatives across 39 countries, driving the rollout of digital core systems, sunsetting legacy applications, and implementing standard ERPs, notably enhancing operational efficiency and business agility. Designing systems with Customer Centricity, User Experience at the core, leveraging Technology, Data and Process re-engineering to deliver Smart Intelligent Digital systems ,\n\nWorked on strategic implementation while ensuring cost optimization, productivity enhancement through technology; focusing on revenue enhancement by utilizing customer application.\nSkilled in executing full lifecycle transformational projects with a verifiable track record of success. Proficient in utilizing project management tools to provide visibility to senior management, ensuring project milestones are achieved on time and within budget.\n\nProficient in vendor management & governance processes, optimizing partner exposures, and ensuring adherence to IT budgets. Skilled in driving cost optimization initiatives while maximizing business value from IT investments.\n…see more",
      "skills": [
        "Center of Excellence Development\nCenter of Excellence Development",
        "Risk & Issues Management\nRisk & Issues Management"
      ],
      "experience": "General Manager\nGeneral Manager\nWelspun Living Limited · Full-time\nWelspun Living Limited · Full-time\nAug 2024 - Present · 1 yr 2 mos\nAug 2024 to Present · 1 yr 2 mos\nMumbai, Maharashtra, India · On-site\nMumbai, Maharashtra, India · On-site\nDigital Road map preparation , implementation in alignment with senior business leaders with milestones for business goals enablement. \nProcess enhancements with AI capabilities, digitizing the process and reducing human intervention\n…see more",
      "company_name": "Welspun Living Limited · Full-time",
      "company_page_url": "https://www.linkedin.com/company/104782953/"
    },
    {
      "lead_id": "ACoAAAAY8doBwtMKuBhPajlMpjJGXMTSaIkmOWM",
      "name": "Maria Criado",
      "title": "Director\nDirector",
      "location": "Greater Madrid Metropolitan Area",
      "profile_url": "https://www.linkedin.com/in/ACoAAAAY8doBwtMKuBhPajlMpjJGXMTSaIkmOWM",
      "bio": "Alliances Go To Market Director\nExperienced Sales Director with a demonstrated history of working in the information technology and services industry. Strong sales professional skilled in Business Development, Sales, Digital Transformation, Customer Relationship Management, Business Planning and Market Research.\nExperienced Sales Director with a demonstrated history of working in the information technology and services industry. Strong sales professional skilled in Business Development, Sales, Digital Transformation, Customer Relationship Management, Business Planning and Market Research.",
      "skills": [
        "Participación de los socios\nParticipación de los socios",
        "Compromiso de los clientes\nCompromiso de los clientes"
      ],
      "experience": "Director\nDirector\nVML THE COCKTAIL · Full-time\nVML THE COCKTAIL · Full-time\nFeb 2023 - Present · 2 yrs 8 mos\nFeb 2023 to Present · 2 yrs 8 mos\nMadrid, Comunidad de Madrid, España · Hybrid\nMadrid, Comunidad de Madrid, España · Hybrid\nCompromiso de los clientes and Participación de los socios",
      "company_name": "VML THE COCKTAIL · Full-time",
      "company_page_url": "https://www.linkedin.com/company/60972/"
    },
    {
      "lead_id": "ACoAABpm_3MB-y6fUAqWvalqCA51xvosC_9ro4s",
      "name": "Mattaparthi Sai Charan",
      "title": "Senior Technical Consultant\nSenior Technical Consultant",
      "location": "East Godavari, Andhra Pradesh, India",
      "profile_url": "https://www.linkedin.com/in/ACoAABpm_3MB-y6fUAqWvalqCA51xvosC_9ro4s",
      "bio": "MuleSoft Mentor || Senior Technical Consultant\nEvery expert was once a beginner !!\n\nCertified MuleSoft Integration and Platform Architect. Responsible for developing and deploying Integration solutions as part of large-scale complex software solutions at enterprise level. Designing and developing these high-volume mission critical layers of business.\n\nLet's Integrate !! 😊\n…see more",
      "skills": [
        "Salesforce.com Development\nSalesforce.com Development",
        "Mule ESB\nMule ESB"
      ],
      "experience": "Senior Technical Consultant\nSenior Technical Consultant\nSalesforce · Full-time\nSalesforce · Full-time\nAug 2025 - Present · 2 mos\nAug 2025 to Present · 2 mos\nHyderabad, Telangana, India\nHyderabad, Telangana, India",
      "company_name": "Salesforce · Full-time",
      "company_page_url": "https://www.linkedin.com/company/3185/"
    },
    {
      "lead_id": "ACoAAAAHQfQBzg9-OvqSYNVOYLV11t9D7Lf1DWc",
      "name": "Rodrigo Guzman",
      "title": "Co-Founder\nCo-Founder",
      "location": "Greater Madrid Metropolitan Area",
      "profile_url": "https://www.linkedin.com/in/ACoAAAAHQfQBzg9-OvqSYNVOYLV11t9D7Lf1DWc",
      "bio": "Co-Founder at Hubble_s\nFor over seven years, I have been leading Hubble_s, a SaaS company that helps organizations achieve their objectives by changing employee behaviors at scale. We leverage our software to empower teams to drive the change that is needed, whether it is in innovation, customer experience, business performance, or culture.\n\nMy passion for transforming operating models and business practices stems from my extensive experience in strategy consulting, where I served CMOs and GMs at global consumer goods and industrial companies, and governments, for more than 17 years. I specialized in organic growth, new growth, category growth, marketing strategy, shopper marketing, innovation strategy, business model innovation, inclusive business models, and growth in emerging markets. I also developed and supervised Monitor's business in Morocco, one of the fastest-growing markets in Africa.\n…see more",
      "skills": [
        "Software as a Service (SaaS)\nSoftware as a Service (SaaS)",
        "SaaS Development\nSaaS Development"
      ],
      "experience": "Co-Founder\nCo-Founder\nHubble_s · Full-time\nHubble_s · Full-time\nFeb 2016 - Present · 9 yrs 8 mos\nFeb 2016 to Present · 9 yrs 8 mos\nMadrid Area, Spain · Remote\nMadrid Area, Spain · Remote\nHubble_s helps companies achieve their objectives by changing employee behaviors at scale.\nWe are a SaaS company and leverage our software to empower teams to drive the change that is needed.\nBusiness Transformation, Behavior Change and +3 skills",
      "company_name": "Hubble_s · Full-time",
      "company_page_url": "https://www.linkedin.com/company/11176749/"
    }
  ],
  "current_index": 46,
  "total_urls": 100,
  "timestamp": 1757531589.74045
}